{"id": "hMG_gR4AAAAJ", "name": "Benjamin Rubinstein", "citations": "", "hindex": "", "papers": [{"title": "Adversarial machine learning", "Authors": "Ling Huang, Anthony D Joseph, Blaine Nelson, Benjamin IP Rubinstein, JD Tygar", "Publication date": "2011/10/21", "Conference": "Proceedings of the 4th ACM Workshop on Security and Artificial Intelligence", "Pages": "43-58", "Publisher": "ACM", "Description": "In this paper (expanded from an invited talk at AISEC 2010), we discuss an emerging field of study: adversarial machine learning---the study of effective machine learning techniques against an adversarial opponent. In this paper, we: give a taxonomy for classifying attacks against online machine learning algorithms; discuss application-specific factors that limit an adversary's capabilities; introduce two models for modeling an adversary's capabilities; explore the limits of an adversary's knowledge about the algorithm, feature space, training, and input data; explore vulnerabilities in machine learning algorithms; discuss countermeasures against attacks; introduce the evasion challenge; and discuss privacy-preserving learning techniques.", "Total citations": "Cited by 471\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Adversarial machine learning\nL Huang, AD Joseph, B Nelson, BIP Rubinstein… - Proceedings of the 4th ACM workshop on Security and …, 2011\nCited by 471 Related articles All 8 versions"}, {"title": "A Bayesian approach to discovering truth from conflicting sources for data integration", "Authors": "Bo Zhao, Benjamin IP Rubinstein, Jim Gemmell, Jiawei Han", "Publication date": "2012/2/1", "Journal": "Proceedings of the VLDB Endowment", "Volume": "5", "Issue": "6", "Pages": "550-561", "Publisher": "VLDB Endowment", "Description": "In practical data integration systems, it is common for the data sources being integrated to provide conflicting information about the same entity. Consequently, a major challenge for data integration is to derive the most complete and accurate integrated records from diverse and sometimes conflicting sources. We term this challenge the truth finding problem. We observe that some sources are generally more reliable than others, and therefore a good model of source quality is the key to solving the truth finding problem. In this work, we propose a probabilistic graphical model that can automatically infer true records and source quality without any supervision. In contrast to previous methods, our principled approach leverages a generative process of two types of errors (false positive and false negative) by modeling two different aspects of source quality. In so doing, ours is also the first approach designed to merge …", "Total citations": "Cited by 284\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "A bayesian approach to discovering truth from conflicting sources for data integration\nB Zhao, BIP Rubinstein, J Gemmell, J Han - Proceedings of the VLDB Endowment, 2012\nCited by 284 Related articles All 16 versions"}, {"title": "ANTIDOTE: Understanding and defending against poisoning of anomaly detectors", "Authors": "Benjamin IP Rubinstein, Blaine Nelson, Ling Huang, Anthony D Joseph, Shing-hon Lau, Satish Rao, Nina Taft, JD Tygar", "Publication date": "2009/11/4", "Conference": "Proceedings of the 9th ACM SIGCOMM Conference on Internet Measurement Conference", "Pages": "1-14", "Publisher": "ACM", "Description": "Statistical machine learning techniques have recently garnered increased popularity as a means to improve network design and security. For intrusion detection, such methods build a model for normal behavior from training data and detect attacks as deviations from that model. This process invites adversaries to manipulate the training data so that the learned model fails to detect subsequent attacks.\nWe evaluate poisoning techniques and develop a defense, in the context of a particular anomaly detector-namely the PCA-subspace method for detecting anomalies in backbone networks. For three poisoning schemes, we show how attackers can substantially increase their chance of successfully evading detection by only adding moderate amounts of poisoned data. Moreover such poisoning throws off the balance between false positives and false negatives thereby dramatically reducing the efficacy of the detector.", "Total citations": "Cited by 192\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Antidote: understanding and defending against poisoning of anomaly detectors\nBIP Rubinstein, B Nelson, L Huang, AD Joseph, S Lau… - Proceedings of the 9th ACM SIGCOMM conference on …, 2009\nCited by 192 Related articles All 13 versions"}, {"title": "Learning in a large function space: Privacy-preserving mechanisms for SVM learning", "Authors": "Benjamin IP Rubinstein, Peter L Bartlett, Ling Huang, Nina Taft", "Publication date": "2012/8/16", "Journal": "Journal of Privacy and Confidentiality", "Volume": "4", "Issue": "1", "Pages": "65-100", "Description": "Several recent studies in privacy-preserving learning have considered the trade-off between utility or risk and the level of differential privacy guaranteed by mechanisms for statistical query processing. In this paper we study this trade-off in private Support Vector Machine (SVM) learning. We present two efficient mechanisms, one for the case of finite-dimensional feature mappings and one for potentially infinite-dimensional feature mappings with translation-invariant kernels. For the case of translation-invariant kernels, the proposed mechanism minimizes regularized empirical risk in a random Reproducing Kernel Hilbert Space whose kernel uniformly approximates the desired kernel with high probability. This technique, borrowed from large-scale learning, allows the mechanism to respond with a finite encoding of the classifier, even when the function class is of infinite VC dimension. Differential privacy is established using a proof technique from algorithmic stability. Utility--the mechanism's response function is pointwise epsilon-close to non-private SVM with probability 1-delta--is proven by appealing to the smoothness of regularized empirical risk minimization with respect to small perturbations to the feature mapping. We conclude with a lower bound on the optimal differential privacy of the SVM. This negative result states that for any delta, no mechanism can be simultaneously (epsilon, delta)-useful and beta-differentially private for small epsilon and small beta.", "Total citations": "Cited by 156\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Learning in a large function space: Privacy-preserving mechanisms for SVM learning\nBIP Rubinstein, PL Bartlett, L Huang, N Taft - arXiv preprint arXiv:0911.5708, 2009\nCited by 156 Related articles All 9 versions"}, {"title": "Exploiting Machine Learning to Subvert Your Spam Filter.", "Authors": "Blaine Nelson, Marco Barreno, Fuching Jack Chi, Anthony D Joseph, Benjamin IP Rubinstein, Udam Saini, Charles A Sutton, J Doug Tygar, Kai Xia", "Publication date": "2008/4/15", "Conference": "First USENIX Workshop on Large-scale Exploits and Emergent Threats (LEET'08)", "Volume": "8", "Pages": "1-9", "Description": "Using statistical machine learning for making security decisions introduces new vulnerabilities in large scale systems. This paper shows how an adversary can exploit statistical machine learning, as used in the SpamBayes spam filter, to render it useless--even if the adversary's access is limited to only 1% of the training messages. We further demonstrate a new class of focused attacks that successfully prevent victims from receiving specific email messages. Finally, we introduce two new types of defenses against these attacks.", "Total citations": "Cited by 154\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Exploiting Machine Learning to Subvert Your Spam Filter.\nB Nelson, M Barreno, FJ Chi, AD Joseph… - LEET, 2008\nCited by 154 Related articles All 24 versions\nAttacking SpamBayes: Compromising a Statistical Spam Filter*\nM Barreno, FJ Chi, AD Joseph, B Nelson…\nRelated articles All 2 versions"}, {"title": "Link prediction by de-anonymization: How we won the kaggle social network challenge", "Authors": "Arvind Narayanan, Elaine Shi, Benjamin IP Rubinstein", "Publication date": "2011/7/31", "Conference": "The 2011 International Joint Conference on Neural Networks (IJCNN)", "Pages": "1825-1834", "Publisher": "IEEE", "Description": "This paper describes the winning entry to the IJCNN 2011 Social Network Challenge run by Kaggle.com. The goal of the contest was to promote research on real-world link prediction, and the dataset was a graph obtained by crawling the popular Flickr social photo sharing website, with user identities scrubbed. By de-anonymizing much of the competition test set using our own Flickr crawl, we were able to effectively game the competition. Our attack represents a new application of de-anonymization to gaming machine learning contests, suggesting changes in how future competitions should be run. We introduce a new simulated annealing-based weighted graph matching algorithm for the seeding step of de-anonymization. We also show how to combine de-anonymization with link prediction-the latter is required to achieve good performance on the portion of the test set not de-anonymized-for example by training …", "Total citations": "Cited by 146\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Link prediction by de-anonymization: How we won the kaggle social network challenge\nA Narayanan, E Shi, BIP Rubinstein - The 2011 International Joint Conference on Neural …, 2011\nCited by 146 Related articles All 17 versions"}, {"title": "Identifying At-Risk Students in Massive Open Online Courses", "Authors": "Jiazhen He, James Bailey, Benjamin I. P. Rubinstein, Rui Zhang", "Publication date": "2015/1/25", "Conference": "Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI'2015)", "Pages": "1749-1755", "Publisher": "AAAI", "Description": "Massive Open Online Courses (MOOCs) have received widespread attention for their potential to scale higher education, with multiple platforms such as Coursera, edX and Udacity recently appearing. Despite their successes, a major problem faced by MOOCs is low completion rates. In this paper, we explore the accurate early identification of students who are at risk of not completing courses. We build predictive models weekly, over multiple offerings of a course. Furthermore, we envision student interventions that present meaningful probabilities of failure, enacted only for marginal students. To be effective, predicted probabilities must be both well-calibrated and smoothed across weeks. Based on logistic regression, we propose two transfer learning algorithms to trade-off smoothness and accuracy by adding a regularization term to minimize the difference of failure probabilities between consecutive weeks. Experimental results on two offerings of a Coursera MOOC establish the effectiveness of our algorithms.", "Total citations": "Cited by 90\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Identifying at-risk students in massive open online courses\nJ He, J Bailey, BIP Rubinstein, R Zhang - Twenty-Ninth AAAI Conference on Artificial Intelligence, 2015\nCited by 90 Related articles All 10 versions"}, {"title": "Adaptive bidding for display advertising", "Authors": "Arpita Ghosh, Benjamin IP Rubinstein, Sergei Vassilvitskii, Martin Zinkevich", "Publication date": "2009/4/20", "Conference": "Proceedings of the 18th International Conference on World Wide Web", "Pages": "251-260", "Publisher": "ACM", "Description": "Motivated by the emergence of auction-based marketplaces for display ads such as the Right Media Exchange, we study the design of a bidding agent that implements a display advertising campaign by bidding in such a marketplace. The bidding agent must acquire a given number of impressions with a given target spend, when the highest external bid in the marketplace is drawn from an unknown distribution P. The quantity and spend constraints arise from the fact that display ads are usually sold on a CPM basis. We consider both the full information setting, where the winning price in each auction is announced publicly, and the partially observable setting where only the winner obtains information about the distribution; these differ in the penalty incurred by the agent while attempting to learn the distribution. We provide algorithms for both settings, and prove performance guarantees using bounds on uniform …", "Total citations": "Cited by 81\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Adaptive bidding for display advertising\nA Ghosh, BIP Rubinstein, S Vassilvitskii, M Zinkevich - Proceedings of the 18th international conference on …, 2009\nCited by 81 Related articles All 18 versions"}, {"title": "Query strategies for evading convex-inducing classifiers", "Authors": "Blaine Nelson, Benjamin IP Rubinstein, Ling Huang, Anthony D Joseph, Steven J Lee, Satish Rao, JD Tygar", "Publication date": "2012", "Journal": "Journal of Machine Learning Research", "Volume": "13", "Issue": "May", "Pages": "1293-1332", "Description": "Classifiers are often used to detect miscreant activities. We study how an adversary can systematically query a classifier to elicit information that allows the attacker to evade detection while incurring a near-minimal cost of modifying their intended malfeasance. We generalize the theory of Lowd and Meek (2005) to the family of convex-inducing classifiers that partition their feature space into two sets, one of which is convex. We present query algorithms for this family that construct undetected instances of approximately minimal cost using only polynomially-many queries in the dimension of the space and in the level of approximation. Our results demonstrate that near-optimal evasion can be accomplished for this family without reverse engineering the classifier's decision boundary. We also consider general l p costs and show that near-optimal evasion on the family of convex-inducing classifiers is generally efficient for both positive and negative convexity for all levels of approximation if p= 1.", "Total citations": "Cited by 76\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Query strategies for evading convex-inducing classifiers\nB Nelson, BIP Rubinstein, L Huang, AD Joseph, SJ Lee… - Journal of Machine Learning Research, 2012\nCited by 76 Related articles All 16 versions"}, {"title": "Evolving quantum circuits using genetic programming", "Authors": "Ben IP Rubinstein", "Publication date": "2001", "Conference": "Proceedings of the 2001 Congress on Evolutionary Computation", "Pages": "144-151", "Publisher": "IEEE", "Description": "The paper presents a new representation and corresponding set of genetic operators for a scheme to evolve quantum circuits with various properties. The scheme is a variant on the techniques of genetic programming and genetic algorithms, having components borrowed from each. By recognising the foundation of a quantum circuit as being a collection of gates, each operating on various categories of qubits and each taking parameters, the scheme can successfully search for most circuits. The algorithm is applied to the problem of entanglement production.", "Total citations": "Cited by 73\n1994\n1995\n1996\n1997\n1998\n1999\n2000\n2001\n2002\n2003\n2004\n2005\n2006\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Evolving quantum circuits using genetic programming\nBIP Rubinstein - Proceedings of the 2001 Congress on Evolutionary …, 2001\nCited by 73 Related articles All 11 versions"}, {"title": "Misleading learners: Co-opting your spam filter", "Authors": "Blaine Nelson, Marco Barreno, Fuching Jack Chi, Anthony D Joseph, Benjamin IP Rubinstein, Udam Saini, Charles Sutton, JD Tygar, Kai Xia", "Publication date": "2009", "Book": "Machine Learning in Cyber Trust", "Pages": "17-51", "Publisher": "Springer US", "Description": "Using statistical machine learning for making security decisions introduces new vulnerabilities in large scale systems. We show how an adversary can exploit statistical machine learning, as used in the SpamBayes spam filter, to render it useless—even if the adversary’s access is limited to only 1% of the spam training messages. We demonstrate three new attacks that successfully make the filter unusable, prevent victims from receiving specific email messages, and cause spam emails to arrive in the victim’s inbox.", "Total citations": "Cited by 61\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Misleading learners: Co-opting your spam filter\nB Nelson, M Barreno, FJ Chi, AD Joseph… - Machine learning in cyber trust, 2009\nCited by 61 Related articles All 19 versions"}, {"title": "Robust and private Bayesian inference", "Authors": "Christos Dimitrakakis, Blaine Nelson, Aikaterini Mitrokotsa, Benjamin IP Rubinstein", "Publication date": "2014/10/8", "Conference": "International Conference on Algorithmic Learning Theory", "Pages": "291-305", "Publisher": "Springer, Cham", "Description": "We examine the robustness and privacy of Bayesian inference, under assumptions on the prior, and with no modifications to the Bayesian framework. First, we generalise the concept of differential privacy to arbitrary dataset distances, outcome spaces and distribution families. We then prove bounds on the robustness of the posterior, introduce a posterior sampling mechanism, show that it is differentially private and provide finite sample bounds for distinguishability-based privacy under a strong adversarial model. Finally, we give examples satisfying our assumptions.", "Total citations": "Cited by 59\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Robust and private Bayesian inference\nC Dimitrakakis, B Nelson, A Mitrokotsa, BIP Rubinstein - International Conference on Algorithmic Learning …, 2014\nCited by 58 Related articles All 13 versions\nRobust, Secure and Private Bayesian Inference*\nC Dimitrakakis, B Nelson, A Mitrokotsa, B Rubinstein - Arxiv, abs/1306.1066, 2013\nCited by 1 Related articles All 4 versions\nDifferential Privacy and Private Bayesian Inference‹*\nC Dimitrakakis, B Nelson, A Mitrokotsa, BIP Rubinstein - Proceedings of NordSec, 2014\nRelated articles All 5 versions"}, {"title": "A learning-based approach to reactive security", "Authors": "Adam Barth, Benjamin IP Rubinstein, Mukund Sundararajan, John C Mitchell, Dawn Song, Peter L Bartlett", "Publication date": "2011/8/25", "Journal": "IEEE Transactions on Dependable and Secure Computing", "Volume": "9", "Issue": "4", "Pages": "482-493", "Publisher": "IEEE", "Description": "Despite the conventional wisdom that proactive security is superior to reactive security, we show that reactive security can be competitive with proactive security as long as the reactive defender learns from past attacks instead of myopically overreacting to the last attack. Our game-theoretic model follows common practice in the security literature by making worst case assumptions about the attacker: we grant the attacker complete knowledge of the defender's strategy and do not require the attacker to act rationally. In this model, we bound the competitive ratio between a reactive defense algorithm (which is inspired by online learning theory) and the best fixed proactive defense. Additionally, we show that, unlike proactive defenses, this reactive strategy is robust to a lack of information about the attacker's incentives and knowledge.", "Total citations": "Cited by 59\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "A learning-based approach to reactive security\nA Barth, BIP Rubinstein, M Sundararajan, JC Mitchell… - IEEE Transactions on Dependable and Secure …, 2011\nCited by 59 Related articles All 39 versions"}, {"title": "Presenting actions and providers associated with entities", "Inventors": "Benjamin Rubinstein, Ashok K Chandra, Olivier Jerzy Dabrowski, David James Gemmell", "Publication date": "2015/11/17", "Patent office": "US", "Patent number": "9189549", "Application number": "12941315", "Description": "Computer-readable media, computer systems, and computing devices method of facilitating presentation of actions and providers associated with entities. The method includes determining a query intent of a received query. Entity sets having an entity that matches the determined query intent are recognized. Each entity set includes an entity, an action, and a provider. Actions and/or providers associated with the entity that matches the determined query intent are identified. The actions and/or the corresponding providers associated with the entity are provided for integration with a representation of the associated entity on a search results page.", "Total citations": "Cited by 43\n2004\n2005\n2006\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Presenting actions and providers associated with entities\nB Rubinstein, AK Chandra, OJ Dabrowski, DJ Gemmell - US Patent 9,189,549, 2015\nCited by 43 Related articles All 4 versions"}, {"title": "Security evaluation of support vector machines in adversarial environments", "Authors": "Battista Biggio, Igino Corona, Blaine Nelson, Benjamin IP Rubinstein, Davide Maiorca, Giorgio Fumera, Giorgio Giacinto, Fabio Roli", "Publication date": "2014", "Book": "Support Vector Machines Applications", "Pages": "105-153", "Publisher": "Springer, Cham", "Description": "Support vector machines (SVMs) are among the most popular classification techniques adopted in security applications like malware detection, intrusion detection, and spam filtering. However, if SVMs are to be incorporated in real-world security systems, they must be able to cope with attack patterns that can either mislead the learning algorithm (poisoning), evade detection (evasion) or gain information about their internal parameters (privacy breaches). The main contributions of this chapter are twofold. First, we introduce a formal general framework for the empirical evaluation of the security of machine-learning systems. Second, according to our framework, we demonstrate the feasibility of evasion, poisoning and privacy attacks against SVMs in real-world security problems. For each attack technique, we evaluate its impact and discuss whether (and how) it can be countered through an adversary-aware …", "Total citations": "Cited by 43\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Security evaluation of support vector machines in adversarial environments\nB Biggio, I Corona, B Nelson, BIP Rubinstein… - Support Vector Machines Applications, 2014\nCited by 43 Related articles All 13 versions"}, {"title": "Near-Optimal Evasion of Convex-Inducing Classifiers.", "Authors": "Blaine Nelson, Benjamin IP Rubinstein, Ling Huang, Anthony D Joseph, Shing-hon Lau, Steven J Lee, Satish Rao, Anthony Tran, J Doug Tygar", "Publication date": "2010/3/14", "Conference": "Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics (AISTATS)", "Pages": "549-556", "Description": "Classifiers are often used to detect miscreant activities. We study how an adversary can efficiently query a classifier to elicit information that allows the adversary to evade detection at near-minimal cost. We generalize results of Lowd and Meek (2005) to convex-inducing classifiers. We present algorithms that construct undetected instances of near-minimal cost using only polynomially many queries in the dimension of the space and without reverse engineering the decision boundary.", "Total citations": "Cited by 43\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Near-optimal evasion of convex-inducing classifiers\nB Nelson, B Rubinstein, L Huang, A Joseph, S Lau… - Proceedings of the Thirteenth International Conference …, 2010\nCited by 43 Related articles All 16 versions"}, {"title": "Stealthy poisoning attacks on PCA-based anomaly detectors", "Authors": "Benjamin IP Rubinstein, Blaine Nelson, Ling Huang, Anthony D Joseph, Shing-hon Lau, Satish Rao, Nina Taft, JD Tygar", "Publication date": "2009/10/16", "Journal": "ACM SIGMETRICS Performance Evaluation Review", "Volume": "37", "Issue": "2", "Pages": "73-74", "Publisher": "ACM", "Description": "We consider systems that use PCA-based detectors obtained from a comprehensive view of the network's traffic to identify anomalies in backbone networks. To assess these detectors' susceptibility to adversaries wishing to evade detection, we present and evaluate short-term and long-term data poisoning schemes that trade-off between poisoning duration and the volume of traffic injected for poisoning. Stealthy Boiling Frog attacks significantly reduce chaff volume, while only moderately increasing poisoning duration. ROC curves provide a comprehensive analysis of PCA-based detection on contaminated data, and show that even small attacks can undermine this otherwise successful anomaly detector.", "Total citations": "Cited by 42\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Stealthy poisoning attacks on PCA-based anomaly detectors\nBIP Rubinstein, B Nelson, L Huang, AD Joseph, S Lau… - ACM SIGMETRICS Performance Evaluation Review, 2009\nCited by 42 Related articles All 11 versions"}, {"title": "Open problems in the security of learning", "Authors": "Marco Barreno, Peter L Bartlett, Fuching Jack Chi, Anthony D Joseph, Blaine Nelson, Benjamin IP Rubinstein, Udam Saini, J Doug Tygar", "Publication date": "2008/10/27", "Conference": "Proceedings of the 1st ACM Workshop on Artificial Intelligence & Security (AISec)", "Pages": "19-26", "Publisher": "ACM", "Description": "Machine learning has become a valuable tool for detecting and preventing malicious activity. However, as more applications employ machine learning techniques in adversarial decision-making situations, increasingly powerful attacks become possible against machine learning systems. In this paper, we present three broad research directions towards the end of developing truly secure learning. First, we suggest that finding bounds on adversarial influence is important to understand the limits of what an attacker can and cannot do to a learning system. Second, we investigate the value of adversarial capabilities-the success of an attack depends largely on what types of information and influence the attacker has. Finally, we propose directions in technologies for secure learning and suggest lines of investigation into secure techniques for learning in adversarial environments. We intend this paper to foster discussion …", "Total citations": "Cited by 42\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Open problems in the security of learning\nM Barreno, PL Bartlett, FJ Chi, AD Joseph, B Nelson… - Proceedings of the 1st ACM workshop on Workshop on …, 2008\nCited by 42 Related articles All 11 versions"}, {"title": "Shifting: One-inclusion mistake bounds and sample compression", "Authors": "Benjamin IP Rubinstein, Peter L Bartlett, J Hyam Rubinstein", "Publication date": "2009/1/1", "Journal": "Journal of Computer and System Sciences", "Volume": "75", "Issue": "1", "Pages": "37-59", "Publisher": "Academic Press", "Description": "We present new expected risk bounds for binary and multiclass prediction, and resolve several recent conjectures on sample compressibility due to Kuzmin and Warmuth. By exploiting the combinatorial structure of concept class F, Haussler et al. achieved a VC (F)/n bound for the natural one-inclusion prediction strategy. The key step in their proof is a d= VC (F) bound on the graph density of a subgraph of the hypercube—one-inclusion graph. The first main result of this paper is a density bound of n (n− 1⩽ d− 1)/(n⩽ d)< d, which positively resolves a conjecture of Kuzmin and Warmuth relating to their unlabeled Peeling compression scheme and also leads to an improved one-inclusion mistake bound. The proof uses a new form of VC-invariant shifting and a group-theoretic symmetrization. Our second main result is an algebraic topological property of maximum classes of VC-dimension d as being d-contractible …", "Total citations": "Cited by 37\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Shifting: One-inclusion mistake bounds and sample compression\nBIP Rubinstein, PL Bartlett, JH Rubinstein - Journal of Computer and System Sciences, 2009\nCited by 37 Related articles All 13 versions\nShifting in the n-Cube: online mistake bounds and the sample compression conjecture*\nBIP Rubinstein - 2009\nRelated articles"}, {"title": "On the differential privacy of Bayesian inference", "Authors": "Zuhe Zhang, Benjamin Rubinstein, Christos Dimitrakakis", "Publication date": "2016/12", "Conference": "Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI'2016)", "Pages": "2365-2371", "Publisher": "AAAI", "Description": "We study how to communicate findings of Bayesian inference to third parties, while preserving the strong guarantee of differential privacy. Our main contributions are four different algorithms for private Bayesian inference on probabilistic graphical models. These include two mechanisms for adding noise to the Bayesian updates, either directly to the posterior parameters, or to their Fourier transform so as to preserve update consistency. We also utilise a recently introduced posterior sampling mechanism, for which we prove bounds for the specific but general case of discrete Bayesian networks; and we introduce a maximum-a-posteriori private mechanism. Our analysis includes utility and privacy bounds, with a novel focus on the influence of graph structure on privacy. Worked examples and experiments with Bayesian naive Bayes and Bayesian linear regression illustrate the application of our mechanisms.", "Total citations": "Cited by 35\n2016\n2017\n2018\n2019", "Scholar articles": "On the differential privacy of Bayesian inference\nZ Zhang, BIP Rubinstein, C Dimitrakakis - Thirtieth AAAI Conference on Artificial Intelligence, 2016\nCited by 35 Related articles All 17 versions"}, {"title": "A geometric approach to sample compression", "Authors": "Benjamin IP Rubinstein, J Hyam Rubinstein", "Publication date": "2012", "Journal": "Journal of Machine Learning Research", "Volume": "13", "Issue": "Apr", "Pages": "1221-1261", "Description": "The Sample Compression Conjecture of Littlestone & Warmuth has remained unsolved for a quarter century. While maximum classes (concept classes meeting Sauer's Lemma with equality) can be compressed, the compression of general concept classes reduces to compressing maximal classes (classes that cannot be expanded without increasing VC dimension). Two promising ways forward are: embedding maximal classes into maximum classes with at most a polynomial increase to VC dimension, and compression via operating on geometric representations. This paper presents positive results on the latter approach and a first negative result on the former, through a systematic investigation of finite maximum classes. Simple arrangements of hyperplanes in hyperbolic space are shown to represent maximum classes, generalizing the corresponding Euclidean result. We show that sweeping a generic hyperplane across such arrangements forms an unlabeled compression scheme of size VC dimension and corresponds to a special case of peeling the one-inclusion graph, resolving a recent conjecture of Kuzmin & Warmuth. A bijection between finite maximum classes and certain arrangements of piecewise-linear (PL) hyperplanes in either a ball or Euclidean space is established. Finally we show that d-maximum classes corresponding to PL-hyperplane arrangements in ℝ d have cubical complexes homeomorphic to a d-ball, or equivalently complexes that are manifolds with boundary. A main result is that PL arrangements can be swept by a moving hyperplane to unlabeled d-compress any finite maximum class, forming a peeling scheme as …", "Total citations": "Cited by 34\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "A geometric approach to sample compression\nBIP Rubinstein, JH Rubinstein - Journal of Machine Learning Research, 2012\nCited by 34 Related articles All 13 versions"}, {"title": "A game theoretical approach to defend against co-resident attacks in cloud computing: Preventing co-residence using semi-supervised learning", "Authors": "Yi Han, Tansu Alpcan, Jeffrey Chan, Christopher Leckie, Benjamin IP Rubinstein", "Publication date": "2015/12/4", "Journal": "IEEE Transactions on information Forensics and Security", "Volume": "11", "Issue": "3", "Pages": "556-570", "Publisher": "IEEE", "Description": "While cloud computing has facilitated easy and affordable access to IT resources, it has also introduced a wide range of security risks from almost every layer and component of cloud systems. In this paper, we focus on one risk at the virtual machine level and the co-resident attack, where by constructing various types of side channels, malicious users can obtain sensitive information from other virtual machines that co-locate on the same physical server. Most previous work has focused on the elimination of side channels, or more generally speaking, the possible countermeasures after attackers co-locate with their targets. In contrast, we provide a different perspective, and propose a defence mechanism that makes it difficult and expensive for attackers to achieve co-residence in the first place. Specifically, we first identify the potential differences between the behaviors of attackers and legal users. Second, we apply …", "Total citations": "Cited by 33\n2016\n2017\n2018\n2019", "Scholar articles": "A game theoretical approach to defend against co-resident attacks in cloud computing: Preventing co-residence using semi-supervised learning\nY Han, T Alpcan, J Chan, C Leckie, BIP Rubinstein - IEEE Transactions on information Forensics and …, 2015\nCited by 33 Related articles All 5 versions"}, {"title": "Classifier evasion: Models and open problems", "Authors": "Blaine Nelson, Benjamin IP Rubinstein, Ling Huang, Anthony D Joseph, JD Tygar", "Publication date": "2010/9/24", "Conference": "International Workshop on Privacy and Security Issues in Data Mining and Machine Learning", "Pages": "92-98", "Publisher": "Springer, Berlin, Heidelberg", "Description": "As a growing number of software developers apply machine learning to make key decisions in their systems, adversaries are adapting and launching ever more sophisticated attacks against these systems. The near-optimal evasion problem considers an adversary that searches for a low-cost negative instance by submitting a minimal number of queries to a classifier, in order to effectively evade the classifier. In this position paper, we posit several open problems and alternative variants to the near-optimal evasion problem. Solutions to these problems would significantly advance the state-of-the-art in secure machine learning.", "Total citations": "Cited by 32\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "Classifier evasion: Models and open problems\nB Nelson, BIP Rubinstein, L Huang, AD Joseph… - International Workshop on Privacy and Security Issues …, 2010\nCited by 32 Related articles All 17 versions"}, {"title": "PPFA: privacy preserving fog-enabled aggregation in smart grid", "Authors": "Lingjuan Lyu, Karthik Nandakumar, Ben Rubinstein, Jiong Jin, Justin Bedo, Marimuthu Palaniswami", "Publication date": "2018/2/8", "Journal": "IEEE Transactions on Industrial Informatics", "Volume": "14", "Issue": "8", "Pages": "3733-3744", "Publisher": "IEEE", "Description": "For constrained end devices in Internet of Things, such as smart meters (SMs), data transmission is an energy-consuming operation. To address this problem, we propose an efficient and privacy-preserving aggregation system with the aid of Fog computing architecture, named PPFA, which enables the intermediate Fog nodes to periodically collect data from nearby SMs and accurately derive aggregate statistics as the fine-grained Fog level aggregation. The Cloud/utility supplier computes overall aggregate statistics by aggregating Fog level aggregation. To minimize the privacy leakage and mitigate the utility loss, we use more efficient and concentrated Gaussian mechanism to distribute noise generation among parties, thus offering provable differential privacy guarantees of the aggregate statistic on both Fog level and Cloud level. In addition, to ensure aggregator obliviousness and system robustness, we put …", "Total citations": "Cited by 27\n2018\n2019", "Scholar articles": "PPFA: privacy preserving fog-enabled aggregation in smart grid\nL Lyu, K Nandakumar, B Rubinstein, J Jin, J Bedo… - IEEE Transactions on Industrial Informatics, 2018\nCited by 27 Related articles"}, {"title": "System and Method for Adaptive Bidding for Display Advertising", "Inventors": "Arpita Ghosh, Benjamin IP Rubinstein, Sergei Vassilvitskii, Martin Zinkevich", "Publication date": "2010/9/30", "Patent office": "US", "Application number": "12414166", "Description": "A system for performing adaptive bidding to secure Internet advertising impressions in an auction. Included are systems for analyzing advertising campaign objectives, including a campaign period, a target number of impressions, a target budget. An exemplary technique defines a bidding agent for performing the adaptive bidding seeking the minimum target spending of the budget. Objective results of the campaign such as average cost per won impression, total campaign duration relative to desired campaign period, and total expenditure relative to campaign budget can be optimized based on an empirically determined forecast. Techniques for adapting bids include statistically modeling winning bids during an exploration bidding phase, performing iterations for adjustment of the bid amounts using learn-while-bid adaptive bidding, learn-then-bid adaptive bidding, and guess-double-adjust adaptive bidding …", "Total citations": "Cited by 25\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "System and Method for Adaptive Bidding for Display Advertising\nA Ghosh, BIP Rubinstein, S Vassilvitskii, M Zinkevich - US Patent App. 12/414,166, 2010\nCited by 25 Related articles All 2 versions"}, {"title": "Compromising PCA-based anomaly detectors for network-wide traffic", "Authors": "Benjamin IP Rubinstein, Blaine Nelson, Ling Huang, Anthony D Joseph, Shing-hon Lau, Nina Taft, Doug Tygar", "Publication date": "2008/5/29", "Journal": "Dept. Elect. Eng. Comput. Sci., Univ. California, Berkeley, Berkeley, CA, USA, Tech. Rep. UCB/EECS-2008-73", "Description": "The use of machine learning techniques to improve network design is gaining popularity. When these techniques are applied to security problems, a fundamental problem arises; namely that they are susceptible to adversaries who poison the learning phase of such techniques. In this paper we focus on PCA-based anomaly detectors used to identify anomalies in backbone networks via a comprehensive view of the network’s traffic. We present four data poisoning schemes and evaluate their effectiveness on increasing an attacker’s chance of evading detection. Because machine learning techniques often require retraining when used on data that is evolving, this also opens the door for attackers to employ stealthy poisoning methods that perturb the PCA detector slowly and covertly over time. We demonstrate that some of these PCA-based attacks can increase the adversary’s chance of success sixfold under relatively moderate attacks, and comment on possible directions for combating these types of attacks.", "Total citations": "Cited by 25\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Compromising PCA-based anomaly detectors for network-wide traffic\nBIP Rubinstein, B Nelson, L Huang, AD Joseph, S Lau… - Dept. Elect. Eng. Comput. Sci., Univ. California …, 2008\nCited by 25 Related articles All 11 versions"}, {"title": "Machine learning in low-level microarray analysis", "Authors": "Benjamin IP Rubinstein, Jon McAuliffe, Simon Cawley, Marimuthu Palaniswami, Kotagiri Ramamohanarao, Terence P Speed", "Publication date": "2003/12/1", "Journal": "ACM SIGKDD Explorations Newsletter", "Volume": "5", "Issue": "2", "Pages": "130-139", "Publisher": "ACM", "Description": "Machine learning and data mining have found a multitude of successful applications in microarray analysis, with gene clustering and classification of tissue samples being widely cited examples. Low-level microarray analysis--often associated with the pre-processing stage within the microarray life-cycle--has increasingly become an area of active research, traditionally involving techniques from classical statistics. This paper explores opportunities for the application of machine learning and data mining methods to several important low-level microarray analysis problems: monitoring gene expression, transcript discovery, genotyping and resequencing. Relevant methods and ideas from the machine learning community include semi-supervised learning, learning from heterogeneous data, and incremental learning.", "Total citations": "Cited by 24\n2003\n2004\n2005\n2006\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016", "Scholar articles": "Machine learning in low-level microarray analysis\nBIP Rubinstein, J McAuliffe, S Cawley, M Palaniswami… - ACM SIGKDD Explorations Newsletter, 2003\nCited by 19 Related articles All 10 versions\nDetecting gene expression with oligonucleotide microarrays*\nBIP Rubinstein, TP Speed - 2003\nCited by 3 Related articles\naffy: Methods for Affymetrix Oligonucleotide Arrays. R Package Version 1.12. 1*\nRA Irizarry, L Gautier, BM Bolstad, CM Magnus Astrand… - 2006\nCited by 2 Related articles"}, {"title": "The Bernstein mechanism: Function release under differential privacy", "Authors": "Francesco Aldà, Benjamin IP Rubinstein", "Publication date": "2017/2/1", "Conference": "Proceedings of the 31st AAAI Conference on Artificial Intelligence (AAAI'2017)", "Description": "We address the problem of general function release under differential privacy, by developing a functional mechanism that applies under the weak assumptions of oracle access to target function evaluation and sensitivity. These conditions permit treatment of functions described explicitly or implicitly as algorithmic black boxes. We achieve this result by leveraging the iterated Bernstein operator for polynomial approximation of the target function, and polynomial coefficient perturbation. Under weak regularity conditions, we establish fast rates on utility measured by high-probability uniform approximation. We provide a lower bound on the utility achievable for any functional mechanism that is epsilon-differentially private. The generality of our mechanism is demonstrated by the analysis of a number of example learners, including naive Bayes, non-parametric estimators and regularized empirical risk minimization. Competitive rates are demonstrated for kernel density estimation; and epsilon-differential privacy is achieved for a broader class of support vector machines than known previously.", "Total citations": "Cited by 18\n2017\n2018\n2019", "Scholar articles": "The Bernstein mechanism: Function release under differential privacy\nF Aldà, BIP Rubinstein - Thirty-First AAAI Conference on Artificial Intelligence, 2017\nCited by 18 Related articles All 6 versions"}, {"title": "Differential privacy for Bayesian inference through posterior sampling", "Authors": "Christos Dimitrakakis, Blaine Nelson, Zuhe Zhang, Aikaterini Mitrokotsa, Benjamin IP Rubinstein", "Publication date": "2017/1/1", "Journal": "The Journal of Machine Learning Research", "Volume": "18", "Issue": "1", "Pages": "343-381", "Publisher": "JMLR. org", "Description": "Differential privacy formalises privacy-preserving mechanisms that provide access to a database. Can Bayesian inference be used directly to provide private access to data? The answer is yes: under certain conditions on the prior, sampling from the posterior distribution can lead to a desired level of privacy and utility. For a uniform treatment, we define differential privacy over arbitrary data set metrics, outcome spaces and distribution families. This allows us to also deal with non-iid or non-tabular data sets. We then prove bounds on the sensitivity of the posterior to the data, which delivers a measure of robustness. We also show how to use posterior sampling to provide differentially private responses to queries, within a decision-theoretic framework. Finally, we provide bounds on the utility of answers to queries and on the ability of an adversary to distinguish between data sets. The latter are complemented by a novel use of Le Cam’s method to obtain lower bounds on distinguishability. Our results hold for arbitrary metrics, including those for the common definition of differential privacy. For specific choices of the metric, we give a number of examples satisfying our assumptions.", "Total citations": "Cited by 16\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Differential privacy for Bayesian inference through posterior sampling\nC Dimitrakakis, B Nelson, Z Zhang, A Mitrokotsa… - The Journal of Machine Learning Research, 2017\nCited by 12 Related articles All 10 versions\nDifferential privacy in a Bayesian setting through posterior sampling*\nC Dimitrakakis, B Nelson, Z Zhang, A Mitrokotsa… - stat, 2015\nCited by 2 Related articles\nBayesian Differential Privacy through Posterior Sampling*\nC Dimitrakakis, B Nelson, A Mitrokotsa, B Rubinstein - arXiv preprint arXiv:1306.1066, 2013\nCited by 2 Related articles All 3 versions\nWhy (Bayesian) inference makes (Differential) privacy easy*\nC Dimitrakakis, B Nelson, A Mitrokotsa, B Rubinstein…\nRelated articles All 2 versions"}, {"title": "Evading anomaly detection through variance injection attacks on PCA", "Authors": "Benjamin IP Rubinstein, Blaine Nelson, Ling Huang, Anthony D Joseph, Shing-hon Lau, Nina Taft, J Doug Tygar", "Publication date": "2008/9/15", "Conference": "The 11th International Symposium on Recent Advances in Intrusion Detection (RAID)", "Pages": "394-395", "Publisher": "Springer Berlin Heidelberg", "Description": "Whenever machine learning is applied to security problems, it is important to measure vulnerabilities to adversaries who poison the training data. We demonstrate the impact of variance injection schemes on PCA-based network-wide volume anomaly detectors, when a single compromised PoP injects chaff into the network. These schemes can increase the chance of evading detection by sixfold, for DoS attacks.", "Total citations": "Cited by 16\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017", "Scholar articles": "Evading anomaly detection through variance injection attacks on PCA\nBIP Rubinstein, B Nelson, L Huang, AD Joseph, S Lau… - International Workshop on Recent Advances in …, 2008\nCited by 16 Related articles All 19 versions"}, {"title": "Enabling Advertisers to Bid on Abstract Objects", "Inventors": "Benjamin Rubinstein, Ashok Chandra, Olivier Dabrowski, David James Gemmell, Min-John Lee", "Publication date": "2012/6/14", "Patent office": "US", "Application number": "12967855", "Description": "Computer-readable media, computer systems, and computing methods are provided for employing abstract objects to solicit bids from advertisers and to present ads submitted by the advertisers upon a user invoking the abstract objects while conducting an online search. The abstract objects include entities, entity classes, actions, and tasks, which are mined by crawling storage locations on the Internet. These abstract objects are monetized by building an index with entries referencing the abstract objects and maintaining the index in a location accessible to advertisers. Via the index, the advertisers target the abstract objects and place bids thereon. During a user-initiated online search, the abstract objects that are relevant to a task being carried out by the user are identified. Further, ads submitted by advertisers that placed bids upon the identified abstract objects are selected for presentation. Based on the bids, the …", "Total citations": "Cited by 15\n2012\n2013\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "Enabling Advertisers to Bid on Abstract Objects\nB Rubinstein, A Chandra, O Dabrowski, DJ Gemmell… - US Patent App. 12/967,855, 2012\nCited by 15 Related articles All 2 versions"}, {"title": "Shifting, one-inclusion mistake bounds and tight multiclass expected risk bounds", "Authors": "Benjamin I Rubinstein, Peter L Bartlett, J Hyam Rubinstein", "Publication date": "2007", "Conference": "Advances in Neural Information Processing Systems", "Pages": "1193-1200", "Description": "Under the prediction model of learning, a prediction strategy is presented with an iid sample of n− 1 points in X and corresponding labels from a concept f∈ F, and aims to minimize the worst-case probability of erring on an nth point. By exploiting the structure of F, Haussler et al. achieved a VC (F)/n bound for the natural one-inclusion prediction strategy, improving on bounds implied by PAC-type results by a O (log n) factor. The key data structure in their result is the natural subgraph of the hypercube—the one-inclusion graph; the key step is a d= VC (F) bound on one-inclusion graph density. The first main result of this paper is a density bound of n (n− 1≤ d− 1)/(n≤ d)< d, which positively resolves a conjecture of Kuzmin & Warmuth relating to their unlabeled Peeling compression scheme and also leads to an improved mistake bound for the randomized (deterministic) one-inclusion strategy for all d (for d≈ Θ (n)). The proof uses a new form of VC-invariant shifting and a group-theoretic symmetrization. Our second main result is a k-class analogue of the d/n mistake bound, replacing the VC-dimension by the Pollard pseudo-dimension and the one-inclusion strategy by its natural hypergraph generalization. This bound on expected risk improves on known PAC-based results by a factor of O (log n) and is shown to be optimal up to a O (log k) factor. The combinatorial technique of shifting takes a central role in understanding the one-inclusion (hyper) graph and is a running theme throughout.", "Total citations": "Cited by 12\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "Shifting, one-inclusion mistake bounds and tight multiclass expected risk bounds\nBI Rubinstein, PL Bartlett, JH Rubinstein - Advances in Neural Information Processing Systems, 2007\nCited by 12 Related articles All 11 versions\nShifting, One-Inclusion Mistake Bounds and Tight Multiclass Expected Risk Bounds*\nBIPRPL Bartlett, JH Rubinstein\nRelated articles"}, {"title": "Health data in an open world", "Authors": "Chris Culnane, Benjamin IP Rubinstein, Vanessa Teague", "Publication date": "2017/12/15", "Journal": "arXiv preprint arXiv:1712.05627", "Description": "With the aim of informing sound policy about data sharing and privacy, we describe successful re-identification of patients in an Australian de-identified open health dataset. As in prior studies of similar datasets, a few mundane facts often suffice to isolate an individual. Some people can be identified by name based on publicly available information. Decreasing the precision of the unit-record level data, or perturbing it statistically, makes re-identification gradually harder at a substantial cost to utility. We also examine the value of related datasets in improving the accuracy and confidence of re-identification. Our re-identifications were performed on a 10% sample dataset, but a related open Australian dataset allows us to infer with high confidence that some individuals in the sample have been correctly re-identified. Finally, we examine the combination of the open datasets with some commercial datasets that are known to exist but are not in our possession. We show that they would further increase the ease of re-identification.\nSubjects: Computers and Society (cs. CY); Cryptography and Security (cs. CR)\nCite as: arXiv: 1712.05627 [cs. CY]\n(or arXiv: 1712.05627 v1 [cs. CY] for this version)\nSubmission history\nFrom: Chris Culnane Dr [view email]\n[v1] Fri, 15 Dec 2017 11: 36: 24 UTC (349 KB)", "Total citations": "Cited by 11\n2018\n2019", "Scholar articles": "Health data in an open world\nC Culnane, BIP Rubinstein, V Teague - arXiv preprint arXiv:1712.05627, 2017\nCited by 11 Related articles All 6 versions"}, {"title": "Machine-learning algorithms predict graft failure after liver transplantation", "Authors": "Lawrence Lau, Yamuna Kankanige, Benjamin Rubinstein, Robert Jones, Christopher Christophi, Vijayaragavan Muralidharan, James Bailey", "Publication date": "2017/4/1", "Journal": "Transplantation", "Volume": "101", "Issue": "4", "Pages": "e125-e132", "Publisher": "LWW", "Description": "Background The ability to predict graft failure or primary nonfunction at liver transplant decision time assists utilization of scarce resource of donor livers, while ensuring that patients who are urgently requiring a liver transplant are prioritized. An index that is derived to predict graft failure using donor and recipient factors, based on local data sets, will be more beneficial in the Australian context.\nMethods Liver transplant data from the Austin Hospital, Melbourne, Australia, from 2010 to 2013 has been included in the study. The top 15 donor, recipient, and transplant factors influencing the outcome of graft failure within 30 days were selected using a machine learning methodology. An algorithm predicting the outcome of interest was developed using those factors.\nResults Donor Risk Index predicts the outcome with an area under the receiver operating characteristic curve (AUC-ROC) value of 0.680 (95% confidence …", "Total citations": "Cited by 11\n2017\n2018\n2019", "Scholar articles": "Machine-learning algorithms predict graft failure after liver transplantation\nL Lau, Y Kankanige, B Rubinstein, R Jones… - Transplantation, 2017\nCited by 11 Related articles All 8 versions"}, {"title": "Improving entity resolution with global constraints", "Authors": "Jim Gemmell, Benjamin IP Rubinstein, Ashok K Chandra", "Publication date": "2011/8/30", "Journal": "arXiv preprint arXiv:1108.6016", "Description": "Some of the greatest advances in web search have come from leveraging socio-economic properties of online user behavior. Past advances include PageRank, anchor text, hubs-authorities, and TF-IDF. In this paper, we investigate another socio-economic property that, to our knowledge, has not yet been exploited: sites that create lists of entities, such as IMDB and Netflix, have an incentive to avoid gratuitous duplicates. We leverage this property to resolve entities across the different web sites, and find that we can obtain substantial improvements in resolution accuracy. This improvement in accuracy also translates into robustness, which often reduces the amount of training data that must be labeled for comparing entities across many sites. Furthermore, the technique provides robustness when resolving sites that have some duplicates, even without first removing these duplicates. We present algorithms with very strong precision and recall, and show that max weight matching, while appearing to be a natural choice turns out to have poor performance in some situations. The presented techniques are now being used in the back-end entity resolution system at a major Internet search engine.", "Total citations": "Cited by 11\n2012\n2013\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "Improving entity resolution with global constraints\nJ Gemmell, BIP Rubinstein, AK Chandra - arXiv preprint arXiv:1108.6016, 2011\nCited by 11 Related articles All 8 versions"}, {"title": "Pain-Free Random Differential Privacy with Sensitivity Sampling", "Authors": "Benjamin IP Rubinstein, Francesco Aldà", "Publication date": "2017/8/6", "Conference": "Proceedings of the 34th International Conference on Machine Learning", "Pages": "2950--2959", "Publisher": "PMLR", "Description": "Popular approaches to differential privacy, such as the Laplace and exponential mechanisms, calibrate randomised smoothing through global sensitivity of the target non-private function. Bounding such sensitivity is often a prohibitively complex analytic calculation. As an alternative, we propose a straightforward sampler for estimating sensitivity of non-private mechanisms. Since our sensitivity estimates hold with high probability, any mechanism that would be (ε, δ)-differentially private under bounded global sensitivity automatically achieves (ε, δ, γ)-random differential privacy (Hall et al., 2012), without any target-specific calculations required. We demonstrate on worked example learners how our usable approach adopts a naturally-relaxed privacy guarantee, while achieving more accurate releases even for non-private functions that are black-box computer programs.", "Total citations": "Cited by 10\n2017\n2018\n2019", "Scholar articles": "Pain-free random differential privacy with sensitivity sampling\nBIP Rubinstein, F Aldà - Proceedings of the 34th International Conference on …, 2017\nCited by 10 Related articles All 6 versions"}, {"title": "Adversarial Machine Learning", "Authors": "Anthony D Joseph, Blaine Nelson, Benjamin IP Rubinstein, JD Tygar", "Publication date": "2018/8/31", "Publisher": "Cambridge University Press", "Description": "Written by leading researchers, this complete introduction brings together all the theory and tools needed for building robust machine learning in adversarial environments. Discover how machine learning systems can adapt when an adversary actively poisons data to manipulate statistical inference, learn the latest practical techniques for investigating system security and performing robust data analysis, and gain insight into new approaches for designing effective countermeasures against the latest wave of cyber-attacks. Privacy-preserving mechanisms and the near-optimal evasion of classifiers are discussed in detail, and in-depth case studies on email spam and network security highlight successful attacks on traditional machine learning algorithms. Providing a thorough overview of the current state of the art in the field, and possible future directions, this groundbreaking work is essential reading for researchers, practitioners and students in computer security and machine learning, and those wanting to learn about the next stage of the cybersecurity arms race.", "Total citations": "Cited by 9\n2018\n2019", "Scholar articles": "Adversarial Machine Learning\nAD Joseph, B Nelson, BIP Rubinstein, JD Tygar - 2018\nCited by 9 Related articles All 3 versions"}, {"title": "E-storm: Replication-based state management in distributed stream processing systems", "Authors": "Xunyun Liu, Aaron Harwood, Shanika Karunasekera, Benjamin Rubinstein, Rajkumar Buyya", "Publication date": "2017/8/14", "Conference": "2017 46th International Conference on Parallel Processing (ICPP)", "Pages": "571-580", "Publisher": "IEEE", "Description": "Apache Storm is a fault-tolerant, distributed inmemory computation system for processing large volumes of high-velocity data in real-time. As an integral part of the fault-tolerance mechanism, Storm's state management is achieved by a checkpointing framework, which commits states regularly and recovers lost states from the latest checkpoint. However, this method involves a remote data store for state preservation and access, resulting in significant overheads to the performance of error-free execution.In this paper, we propose E-Storm, a replication-based state management system that actively maintains multiple state backups on different worker nodes. We build a prototype on top of Storm by extending it with monitoring and recovery modules to support inter-task state transfer whenever needed. The experiments carried out on synthetic and real-world streaming applications confirm that E-Storm outperforms the …", "Total citations": "Cited by 9\n2018\n2019", "Scholar articles": "E-storm: Replication-based state management in distributed stream processing systems\nX Liu, A Harwood, S Karunasekera, B Rubinstein… - 2017 46th International Conference on Parallel …, 2017\nCited by 9 Related articles All 11 versions"}, {"title": "Scaling multiple-source entity resolution using statistically efficient transfer learning", "Authors": "Sahand N Negahban, Benjamin IP Rubinstein, Jim Gemmell", "Publication date": "2012/10/29", "Conference": "Proceedings of the 21st ACM International Conference on Information and Knowledge Management", "Pages": "2224-2228", "Publisher": "ACM", "Description": "We consider a serious, previously-unexplored challenge facing almost all approaches to scaling up entity resolution (ER) to multiple data sources: the prohibitive cost of labeling training data for supervised learning of similarity scores for each pair of sources. While there exists a rich literature describing almost all aspects of pairwise ER, this new challenge is arising now due to the unprecedented ability to acquire and store data from online sources, interest in features driven by ER such as enriched search verticals, and the uniqueness of noisy and missing data characteristics for each source. We show on real-world and synthetic data that for state-of-the-art techniques, the reality of heterogeneous sources means that the number of labeled training data must scale quadratically in the number of sources, just to maintain constant precision/recall. We address this challenge with a brand new transfer learning algorithm …", "Total citations": "Cited by 9\n2013\n2014\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Scaling multiple-source entity resolution using statistically efficient transfer learning\nSN Negahban, BIP Rubinstein, JG Gemmell - Proceedings of the 21st ACM international conference …, 2012\nCited by 9 Related articles All 6 versions"}, {"title": "The CASE histogram: Privacy-aware processing of trajectory data using aggregates", "Authors": "Maryam Fanaeepour, Lars Kulik, Egemen Tanin, Benjamin IP Rubinstein", "Publication date": "2015/10/1", "Journal": "GeoInformatica", "Volume": "19", "Issue": "4", "Pages": "747-798", "Publisher": "Springer US", "Description": "Due to the high uptake of location-based services (LBSs), large spatio-temporal datasets of moving objects’ trajectories are being created every day. An important task in spatial data analytics is to service range queries by returning trajectory counts within a queried region. The question of how to keep an individual user’s data private whilst enabling spatial data analytics by third parties has become an urgent research direction. Indeed, it is increasingly becoming a concern for users. To preserve privacy we discard individual trajectories and aggregate counts over a spatial and temporal partition. However the privacy gained comes at a cost to utility: trajectories passing through multiple cells and re-entering a query region, lead to inaccurate query responses. This is known as the distinct counting problem. We propose the Connection Aware Spatial Euler (CASE) histogram to address this long-standing …", "Total citations": "Cited by 8\n2015\n2016\n2017\n2018", "Scholar articles": "The CASE histogram: privacy-aware processing of trajectory data using aggregates\nM Fanaeepour, L Kulik, E Tanin, BIP Rubinstein - GeoInformatica, 2015\nCited by 8 Related articles All 7 versions"}, {"title": "Principled graph matching algorithms for integrating multiple data sources", "Authors": "Duo Zhang, Benjamin IP Rubinstein, Jim Gemmell", "Publication date": "2015/4/27", "Journal": "IEEE Transactions on Knowledge and Data Engineering", "Volume": "27", "Issue": "10", "Pages": "2784-2796", "Publisher": "IEEE", "Description": "This paper explores combinatorial optimization for problems of max-weight graph matching on multi-partite graphs, which arise in integrating multiple data sources. In the most common two-source case, it is often desirable for the final matching to be one-to-one; the database and statistical record linkage communities accomplish this by weighted bipartite graph matching on similarity scores. Such matchings are intuitively appealing: they leverage a natural global property of many real-world entity stores-that of being nearly deduped-and are known to provide significant improvements to precision and recall. Unfortunately, unlike the bipartite case, exact max-weight matching on multi-partite graphs is known to be NP-hard. Our two-fold algorithmic contributions approximate multi-partite max-weight matching: our first algorithm borrows optimization techniques common to Bayesian probabilistic inference; our second is a …", "Total citations": "Cited by 8\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Principled graph matching algorithms for integrating multiple data sources\nD Zhang, BIP Rubinstein, J Gemmell - IEEE Transactions on Knowledge and Data …, 2015\nCited by 8 Related articles All 9 versions"}, {"title": "Fast trajectory clustering using Hashing methods", "Authors": "Ivan Sanchez, Zay Maung Maung Aye, Benjamin IP Rubinstein, Kotagiri Ramamohanarao", "Publication date": "2016/7/24", "Conference": "2016 International Joint Conference on Neural Networks (IJCNN)", "Pages": "3689-3696", "Publisher": "IEEE", "Description": "There has been an explosion in the usage of trajectory data. Clustering is one of the simplest and most powerful approaches for knowledge discovery from trajectories. In order to produce meaningful clusters, well-defined metrics are required to capture the essence of similarity between trajectories. One such distance function is Dynamic Time Warping (DTW), which aligns two trajectories together in order to determine similarity. DTW has been widely accepted as a very good distance measure for trajectory data. However, trajectory clustering is very expensive due to the complexity of the similarity functions, for example, DTW has a high computational cost O(n2), where n is the average length of the trajectory, which makes the clustering process very expensive. In this paper, we propose the use of hashing techniques based on Distance-Based Hashing (DBH) and Locality Sensitive Hashing (LSH) to produce …", "Total citations": "Cited by 7\n2017\n2018\n2019", "Scholar articles": "Fast trajectory clustering using hashing methods\nI Sanchez, ZMM Aye, BIP Rubinstein… - 2016 International Joint Conference on Neural …, 2016\nCited by 7 Related articles"}, {"title": "Bounding embeddings of VC classes into maximum classes", "Authors": "J Hyam Rubinstein, Benjamin IP Rubinstein, Peter L Bartlett", "Publication date": "2015", "Book": "Measures of complexity", "Pages": "303-325", "Publisher": "Springer, Cham", "Description": "One of the earliest conjectures in computational learning theory—the Sample Compression conjecture—asserts that concept classes (equivalently set systems) admit compression schemes of size linear in their VC dimension.", "Total citations": "Cited by 7\n2015\n2016\n2017\n2018\n2019", "Scholar articles": "Bounding embeddings of VC classes into maximum classes\nJH Rubinstein, BIP Rubinstein, PL Bartlett - Measures of complexity, 2015\nCited by 7 Related articles All 11 versions"}, {"title": "How Open Should Open Source Be?", "Authors": "Adam Barth, Saung Li, Benjamin I. P. Rubinstein, Dawn Song", "Publication date": "2011/8/31", "Journal": "arXiv preprint arxiv:1109.0507", "Description": "Many open-source projects land security fixes in public repositories before shipping these patches to users. This paper presents attacks on such projects-taking Firefox as a case-study-that exploit patch metadata to efficiently search for security patches prior to shipping. Using access-restricted bug reports linked from patch descriptions, security patches can be immediately identified for 260 out of 300 days of Firefox 3 development. In response to Mozilla obfuscating descriptions, we show that machine learning can exploit metadata such as patch author to search for security patches, extending the total window of vulnerability by 5 months in an 8 month period when examining up to two patches daily. Finally we present strong evidence that further metadata obfuscation is unlikely to prevent information leaks, and we argue that open-source projects instead ought to keep security patches secret until they are ready to be released.", "Total citations": "Cited by 7\n2012\n2013\n2014\n2015\n2016", "Scholar articles": "How Open Should Open Source Be?\nA Barth, S Li, BIP Rubinstein, D Song - arXiv preprint arXiv:1109.0507, 2011\nCited by 7 Related articles All 8 versions"}, {"title": "Geometric & Topological Representations of Maximum Classes with Applications to Sample Compression.", "Authors": "J Hyam Rubinstein, Benjamin IP Rubinstein", "Publication date": "2008", "Conference": "Proceedings of the 21st Annual Conference on Learning Theory (COLT)", "Pages": "299-310", "Description": "We systematically investigate finite maximum classes, which play an important role in machine learning as concept classes meeting Sauer’s Lemma with equality. Simple arrangements of hyperplanes in Hyperbolic space are shown to represent maximum classes, generalizing the corresponding Euclidean result. We show that sweeping a generic hyperplane across such arrangements forms an unlabeled compression scheme of size VC dimension and corresponds to a special case of peeling the one-inclusion graph, resolving a conjecture of Kuzmin & Warmuth. A bijection between maximum classes and certain arrangements of Piecewise-Linear (PL) hyperplanes in either a ball or Euclidean space is established. Finally, we show that d-maximum classes corresponding to PL hyperplane arrangements in Rd have cubical complexes homeomorphic to a d-ball, or equivalently complexes that are manifolds with boundary.", "Total citations": "Cited by 7\n2009\n2010\n2011\n2012\n2013\n2014\n2015", "Scholar articles": "Geometric & Topological Representations of Maximum Classes with Applications to Sample Compression.\nJH Rubinstein, BIP Rubinstein - COLT, 2008\nCited by 7 Related articles All 8 versions"}, {"title": "MOOCs meet measurement theory: A topic-modelling approach", "Authors": "Jiazhen He, Benjamin IP Rubinstein, James Bailey, Rui Zhang, Sandra Milligan, Jeffrey Chan", "Publication date": "2016/2/1", "Conference": "Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI'2016)", "Pages": "1195-1201", "Description": "This paper adapts topic models to the psychometric testing of MOOC students based on their online forum postings. Measurement theory from education and psychology provides statistical models for quantifying a person's attainment of intangible attributes such as attitudes, abilities or intelligence. Such models infer latent skill levels by relating them to individuals' observed responses on a series of items such as quiz questions. The set of items can be used to measure a latent skill if individuals' responses on them conform to a Guttman scale. Such well-scaled items differentiate between individuals and inferred levels span the entire range from most basic to the advanced. In practice, education researchers manually devise items (quiz questions) while optimising well-scaled conformance. Due to the costly nature and expert requirements of this process, psychometric testing has found limited use in everyday teaching. We aim to develop usable measurement models for highly-instrumented MOOC delivery platforms, by using participation in automatically-extracted online forum topics as items. The challenge is to formalise the Guttman scale educational constraint and incorporate it into topic models. To favour topics that automatically conform to a Guttman scale, we introduce a novel regularisation into non-negative matrix factorisation-based topic modelling. We demonstrate the suitability of our approach with both quantitative experiments on three Coursera MOOCs, and with a qualitative survey of topic interpretability on two MOOCs by domain expert interviews.", "Total citations": "Cited by 6\n2016\n2017\n2018", "Scholar articles": "MOOCs meet measurement theory: a topic-modelling approach\nJ He, BIP Rubinstein, J Bailey, R Zhang, S Milligan… - Thirtieth AAAI Conference on Artificial Intelligence, 2016\nCited by 6 Related articles All 9 versions"}, {"title": "Adequacy of the gradient-descent method for classifier evasion attacks", "Authors": "Yi Han, Benjamin Rubinstein", "Publication date": "2018/6/20", "Conference": "Workshops at the Thirty-Second AAAI Conference on Artificial Intelligence", "Description": "Despite the widespread use of machine learning in adversarial settings such as computer security, recent studies have demonstrated vulnerabilities to evasion attacks---carefully crafted adversarial samples that closely resemble legitimate instances, but cause misclassification. In this paper, we examine the adequacy of the leading approach to generating adversarial samples---the gradient-descent approach. In particular (1) we perform extensive experiments on three datasets, MNIST, USPS and Spambase, in order to analyse the effectiveness of the gradient-descent method against non-linear support vector machines, and conclude that carefully reduced kernel smoothness can significantly increase robustness to the attack;(2) we demonstrate that separated inter-class support vectors lead to more secure models, and propose a quantity similar to margin that can efficiently predict potential susceptibility to gradient-descent attacks, before the attack is launched; and (3) we design a new adversarial sample construction algorithm based on optimising the multiplicative ratio of class decision functions.", "Total citations": "Cited by 5\n2017\n2018\n2019", "Scholar articles": "Adequacy of the gradient-descent method for classifier evasion attacks\nY Han, B Rubinstein - Workshops at the Thirty-Second AAAI Conference on …, 2018\nCited by 5 Related articles All 7 versions"}, {"title": "In Search of an Entity Resolution OASIS: Optimal Asymptotic Sequential Importance Sampling", "Authors": "Neil G Marchant, Benjamin IP Rubinstein", "Publication date": "2017/8", "Journal": "Proceedings of the VLDB Endowment", "Volume": "10", "Issue": "11", "Pages": "1322-1333", "Publisher": "VLDB Endowment", "Description": "Entity resolution (ER) presents unique challenges for evaluation methodology. While crowdsourcing platforms acquire ground truth, sound approaches to sampling must drive labelling efforts. In ER, extreme class imbalance between matching and non-matching records can lead to enormous labelling requirements when seeking statistically consistent estimates for rigorous evaluation. This paper addresses this important challenge with the OASIS algorithm: a sampler and F-measure estimator for ER evaluation. OASIS draws samples from a (biased) instrumental distribution, chosen to ensure estimators with optimal asymptotic variance. As new labels are collected OASIS updates this instrumental distribution via a Bayesian latent variable model of the annotator oracle, to quickly focus on unlabelled items providing more information. We prove that resulting estimates of F-measure, precision, recall converge to the true …", "Total citations": "Cited by 5\n2018\n2019", "Scholar articles": "In search of an entity resolution OASIS: optimal asymptotic sequential importance sampling\nNG Marchant, BIP Rubinstein - Proceedings of the VLDB Endowment, 2017\nCited by 5 Related articles All 6 versions"}, {"title": "Reinforcement learning for autonomous defence in software-defined networking", "Authors": "Yi Han, Benjamin IP Rubinstein, Tamas Abraham, Tansu Alpcan, Olivier De Vel, Sarah Erfani, David Hubczenko, Christopher Leckie, Paul Montague", "Publication date": "2018/10/29", "Conference": "International Conference on Decision and Game Theory for Security", "Pages": "145-165", "Publisher": "Springer, Cham", "Description": "Despite the successful application of machine learning (ML) in a wide range of domains, adaptability—the very property that makes machine learning desirable—can be exploited by adversaries to contaminate training and evade classification. In this paper, we investigate the feasibility of applying a specific class of machine learning algorithms, namely, reinforcement learning (RL) algorithms, for autonomous cyber defence in software-defined networking (SDN). In particular, we focus on how an RL agent reacts towards different forms of causative attacks that poison its training process, including indiscriminate and targeted, white-box and black-box attacks. In addition, we also study the impact of the attack timing, and explore potential countermeasures such as adversarial training.", "Total citations": "Cited by 4\n2018\n2019", "Scholar articles": "Reinforcement learning for autonomous defence in software-defined networking\nY Han, BIP Rubinstein, T Abraham, T Alpcan, O De Vel… - International Conference on Decision and Game …, 2018\nCited by 4 Related articles All 5 versions"}, {"title": "Beyond points and paths: Counting private bodies", "Authors": "Maryam Fanaeepour, Benjamin IP Rubinstein", "Publication date": "2016/12/12", "Conference": "2016 IEEE 16th International Conference on Data Mining (ICDM)", "Pages": "131-140", "Publisher": "IEEE", "Description": "Mining of spatial data is an enabling technology for mobile services, Internet-connected cars, and the Internet of Things. But the very distinctiveness of spatial data that drives utility, comes at the cost of user privacy. In this work, we continue the tradition of privacy-preserving spatial analytics, focusing not on point or path data, but on planar spatial regions. Such data represents the area of a user's most frequent visitation-such as \"around home and nearby shops\". Specifically we consider the differentially-private release of data structures that support range queries for counting users' spatial regions. Counting planar regions leads to unique challenges not faced in existing work. A user's spatial region that straddles multiple data structure cells can lead to duplicate counting at query time. We provably avoid this pitfall by leveraging the Euler characteristic. To address the increased sensitivity of range queries to spatial …", "Total citations": "Cited by 4\n2017\n2018", "Scholar articles": "Beyond points and paths: Counting private bodies\nM Fanaeepour, BIP Rubinstein - 2016 IEEE 16th International Conference on Data …, 2016\nCited by 4 Related articles All 4 versions"}, {"title": "Privacy assessment of de-identified opal data: A report for transport for NSW", "Authors": "Chris Culnane, Benjamin IP Rubinstein, Vanessa Teague", "Publication date": "2017/4/27", "Journal": "arXiv preprint arXiv:1704.08547", "Description": "We consider the privacy implications of public release of a de-identified dataset of Opal card transactions. The data was recently published at this https URL. It consists of tap-on and tap-off counts for NSW's four modes of public transport, collected over two separate week-long periods. The data has been further treated to improve privacy by removing small counts, aggregating some stops and routes, and perturbing the counts. This is a summary of our findings.", "Total citations": "Cited by 3\n2017\n2018\n2019", "Scholar articles": "Privacy assessment of de-identified opal data: A report for transport for NSW\nC Culnane, BIP Rubinstein, V Teague - arXiv preprint arXiv:1704.08547, 2017\nCited by 3 Related articles All 4 versions"}, {"title": "On the challenges of balancing privacy and utility of open health data", "Authors": "Christian Guttmann, Xingzhi Sun, Chaitanya Rao, Carlos Queiroz, Benjamin IP Rubinstein", "Publication date": "2013/8/4", "Conference": "Joint Proceedings of the Workshop on AI Problems and Approaches for Intelligent Environments and Workshop on Semantic Cities", "Pages": "43-47", "Publisher": "ACM", "Description": "While health data has been collected at large scale for many years, this data is often difficult to obtain for the purpose of research. This is in part due to the cost and complexities involved in preparing this data for third parties. Health data must be adequately de-identified--a complex process resulting in full or partial\" synthetic\" data. This paper discusses technological challenges in this process when balancing the preservation of an individual's privacy against the preservation of the data's utility. An example is open health data, where the process of de-identification is often so rigorous that the data is useless for meaningful observational studies. Our discussion is made concrete by considering an open health data set by the American Centres of Medicare and Medicaid Services (CMS).", "Total citations": "Cited by 3\n2014\n2015\n2016\n2017\n2018", "Scholar articles": "On the challenges of balancing privacy and utility of open health data\nC Guttmann, X Sun, C Rao, C Queiroz, BIP Rubinstein - Joint Proceedings of the Workshop on AI Problems and …, 2013\nCited by 3 Related articles"}, {"title": "Generating scoring functions using transfer learning", "Inventors": "Benjamin Rubinstein, Olivier Dabrowski, Sahand Negahban-Hagh, David James Gemmell", "Publication date": "2013/7/18", "Patent office": "US", "Application number": "13350821", "Description": "Data sources, such as web pages or databases, store or output entities that include data or other information. To compare entities generated by different data sources, and to identify duplicate entities, a scoring function is generated for each pair of data sources that can generate a similarity score that represents the similarity of two entities from the data sources in the pair. To generate the scoring functions, training data is generated for each pair of data sources and reviewed by a judge. The training data is used to generate the scoring functions using machine learning. In order to reduce the amount of training data that is used, transfer learning techniques are applied to use information learned from generating one scoring function for a pair of sources when generating a scoring function for a subsequent pair of sources.", "Total citations": "Cited by 3\n2015\n2016\n2017\n2018", "Scholar articles": "Generating scoring functions using transfer learning\nB Rubinstein, O Dabrowski, S Negahban-Hagh… - US Patent App. 13/350,821, 2013\nCited by 3 Related articles All 2 versions"}, {"title": "Histogramming Privately Ever After: Differentially-Private Data-Dependent Error Bound Optimisation", "Authors": "Maryam Fanaeepour, Benjamin IP Rubinstein", "Publication date": "2018/4/16", "Conference": "2018 IEEE 34th International Conference on Data Engineering (ICDE)", "Pages": "1204-1207", "Publisher": "IEEE", "Description": "Hay et al. (2016) recently observed that existing histogram release mechanisms under differential privacy do not provide satisfactory privacy protection. Existing work either tunes on sensitive data to optimise parameters without consideration of privacy; or selection is performed arbitrarily and independent of data, degrading utility. We address this open problem by deriving a principled tuning mechanism E2EPRIV that privately optimises data-dependent error bounds. Theoretical analysis establishes privacy and utility, while extensive experimentation demonstrates that E2EPRIV can practically achieve true end-to-end privacy.", "Total citations": "Cited by 2\n2018\n2019", "Scholar articles": "Histogramming Privately Ever After: Differentially-Private Data-Dependent Error Bound Optimisation\nM Fanaeepour, BIP Rubinstein - 2018 IEEE 34th International Conference on Data …, 2018\nCited by 1 Related articles All 2 versions\nEnd-to-end differentially-private parameter tuning in spatial histograms*\nM Fanaeepour, BIP Rubinstein - arXiv preprint arXiv:1702.05607, 2017\nCited by 1 Related articles All 4 versions"}, {"title": "Sublinear-time adaptive data analysis", "Authors": "Benjamin Fish, Lev Reyzin, Benjamin IP Rubinstein", "Publication date": "2017/9/28", "Journal": "arXiv preprint arXiv:1709.09778", "Description": "The central aim of most fields of data analysis and experimental scientific investigation is to draw valid conclusions from a given data set. But when past inferences guide future inquiries into the same dataset, reaching valid inferences becomes significantly more difficult. In addition to avoiding the overfitting that can result from adaptive analysis, a data analyst often wants to use as little time and data as possible. A recent line of work in the theory community has established mechanisms that provide low generalization error on adaptive queries, yet there remain large gaps between established theoretical results and how data analysis is done in practice. Many practitioners, for instance, successfully employ bootstrapping and related sampling approaches in order to maintain validity and speed up analysis, but prior to this work, no theoretical analysis existed to justify employing such techniques in this adaptive setting.\nIn this paper, we show how these techniques can be used to provably guarantee validity while speeding up analysis. Through this investigation, we initiate the study of sub-linear time mechanisms to answer adaptive queries into datasets. Perhaps surprisingly, we describe mechanisms that provide an exponential speed-up per query over previous mechanisms, without needing to increase the total amount of data needed for low generalization error. We also provide a method for achieving statistically-meaningful responses even when the mechanism is only allowed to see a constant number of samples from the data per query.\nSubjects: Machine Learning (cs. LG); Data Structures and Algorithms (cs. DS)\nCite as: arXiv: 1709.09778 [cs. LG …", "Total citations": "Cited by 2\n2018", "Scholar articles": "Sublinear-time adaptive data analysis\nB Fish, L Reyzin, BIP Rubinstein - arXiv preprint arXiv:1709.09778, 2017\nCited by 2 Related articles All 6 versions"}, {"title": "Large-scale strategic games and adversarial machine learning", "Authors": "Tansu Alpcan, Benjamin IP Rubinstein, Christopher Leckie", "Publication date": "2016/12/12", "Conference": "2016 IEEE 55th Conference on Decision and Control (CDC)", "Pages": "4420-4426", "Publisher": "IEEE", "Description": "Decision making in modern large-scale and complex systems such as communication networks, smart electricity grids, and cyber-physical systems motivate novel game-theoretic approaches. This paper investigates big strategic (non-cooperative) games where a finite number of individual players each have a large number of continuous decision variables and input data points. Such high-dimensional decision spaces and big data sets lead to computational challenges, relating to efforts in non-linear optimization scaling up to large systems of variables. In addition to these computational challenges, real-world players often have limited information about their preference parameters due to the prohibitive cost of identifying them or due to operating in dynamic online settings. The challenge of limited information is exacerbated in high dimensions and big data sets. Motivated by both computational and information …", "Total citations": "Cited by 2\n2018\n2019", "Scholar articles": "Large-scale strategic games and adversarial machine learning\nT Alpcan, BIP Rubinstein, C Leckie - 2016 IEEE 55th Conference on Decision and Control …, 2016\nCited by 2 Related articles All 4 versions"}, {"title": "Validity: a framework for cross-disciplinary collaboration in mining indicators of learning from MOOC forums", "Authors": "Sandra Milligan, Jiazhen He, James Bailey, Rui Zhang, Benjamin IP Rubinstein", "Publication date": "2016/4/25", "Conference": "proceedings of the sixth international conference on learning analytics & knowledge", "Pages": "546-547", "Publisher": "ACM", "Description": "Two research teams from the University of Melbourne's Learning Analytics Research Group used validation as applied in educational measurement to provide a framework for collaboration. One team was focussed on defining and building measures of learning capability of MOOCs participants, and the other on using topic modelling to discover topics in MOOC forums. The collaboration explored the suitability of items discovered from MOOC forums using topic modelling as measures of learning capability of participants in MOOCs.", "Total citations": "Cited by 2\n2017\n2018", "Scholar articles": "Validity: a framework for cross-disciplinary collaboration in mining indicators of learning from MOOC forums\nS Milligan, J He, J Bailey, R Zhang, BIP Rubinstein - proceedings of the sixth international conference on …, 2016\nCited by 2 Related articles"}, {"title": "Entity-based aggregation of endorsement data", "Inventors": "Ashok K Chandra, Olivier J Dabrowski, David James Gemmell, Benjamin Rubinstein", "Publication date": "2013/12/26", "Patent office": "US", "Application number": "13531320", "Description": "Systems, methods, and computer-readable storage media for performing entity-based aggregation of endorsement data are provided. Entity-endorsement data is received from a plurality of different sources, eg, websites, web pages, database records, files, data feeds, or networks. Entity resolution is then performed to identify like entities. Once the entities are resolved, the relevant endorsement data from each appropriate source is aggregated. The aggregated endorsement data may then be presented with or without an identification of the sources from which the data was aggregated. In this way, sparseness and fragmentation of endorsement data are mitigated and a more complete picture of an entity's endorsement status may be seen.", "Total citations": "Cited by 2\n2015\n2016\n2017\n2018", "Scholar articles": "Entity-based aggregation of endorsement data\nAK Chandra, OJ Dabrowski, DJ Gemmell, B Rubinstein - US Patent App. 13/531,320, 2013\nCited by 2 Related articles All 2 versions"}, {"title": "On the stability of empirical risk minimization in the presence of multiple risk minimizers", "Authors": "Benjamin IP Rubinstein, Aleksandr Simma", "Publication date": "2012/3/21", "Journal": "IEEE Transactions on Information Theory", "Volume": "58", "Issue": "7", "Pages": "4160-4163", "Publisher": "IEEE", "Description": "Recently, Kutin and Niyogi investigated several notions of algorithmic stability-a property of a learning map conceptually similar to continuity-showing that training stability is sufficient for consistency of empirical risk minimization (ERM) while distribution-free CV-stability is necessary and sufficient for having finite VC-dimension. This paper concerns a phase transition in the training stability of ERM, conjectured by the same authors. Kutin and Niyogi proved that ERM on finite hypothesis spaces containing a unique risk minimizer has training stability that scales exponentially with sample size, and conjectured that the existence of multiple risk minimizers prevents even super-quadratic convergence. We prove this result for the strictly weaker notion of CV-stability, positively resolving the conjecture.", "Total citations": "Cited by 2\n2014\n2015\n2016", "Scholar articles": "On the stability of empirical risk minimization in the presence of multiple risk minimizers\nBIP Rubinstein, A Simma - IEEE Transactions on Information Theory, 2012\nCited by 2 Related articles All 9 versions"}, {"title": "Secure Learning and Learning for Security: Research in the Intersection", "Authors": "Benjamin I. P. Rubinstein", "Publication date": "2010/5/13", "Source": "Department of Electrical Engineering & Computer Sciences, University of California, Berkeley", "Issue": "UCB/EECS-2010-71", "Institution": "Department of Electrical Engineering & Computer Sciences, University of California, Berkeley", "Description": "Statistical Machine Learning is used in many real-world systems, such as web search, network and power management, online advertising, finance and health services, in which adversaries are incentivized to attack the learner, motivating the urgent need for a better understanding of the security vulnerabilities of adaptive systems. Conversely, research in Computer Security stands to reap great benefits by leveraging learning for building adaptive defenses and even designing intelligent attacks on existing systems. This dissertation contributes new results in the intersection of Machine Learning and Security, relating to both of these complementary research agendas. The first part of this dissertation considers Machine Learning under the lens of Computer Security, where the goal is to learn in the presence of an adversary. Two large case-studies on email spam filtering and network-wide anomaly detection explore adversaries that manipulate a learner by poisoning its training data. In the first study, the False Positive Rate (FPR) of an open-source spam filter is increased to 40% by feeding the filter a training set made up of 99% regular legitimate and spam messages, and 1% dictionary attack spam messages containing legitimate words. By increasing the FPR the adversary a defects a Denial of Service attack on the filter. In the second case-study, the False Negative Rate of a popular network-wide anomaly detector based on Principal Components Analysis is increased 7-fold (increasing the attacker's chance of subsequent evasion by the same amount) by a variance injection attack of chaff traffic inserted into the network at training time. This high …", "Total citations": "Cited by 2\n2010\n2011\n2012", "Scholar articles": "Secure Learning and Learning for Security: Research in the Intersection\nBI Rubinstein - 2010\nCited by 2 Related articles All 16 versions"}, {"title": "Vulnerabilities in the use of similarity tables in combination with pseudonymisation to preserve data privacy in the UK Office for National Statistics' Privacy-Preserving …", "Authors": "Chris Culnane, Benjamin IP Rubinstein, Vanessa Teague", "Publication date": "2017/12/4", "Journal": "arXiv preprint arXiv:1712.00871", "Description": "In the course of a survey of privacy-preserving record linkage, we reviewed the approach taken by the UK Office for National Statistics (ONS) as described in their series of reports\" Beyond 2011\". Our review identifies a number of matters of concern. Some of the issues discovered are sufficiently severe to present a risk to privacy.\nSubjects: Cryptography and Security (cs. CR)\nCite as: arXiv: 1712.00871 [cs. CR]\n(or arXiv: 1712.00871 v1 [cs. CR] for this version)\nSubmission history\nFrom: Chris Culnane Dr [view email]\n[v1] Mon, 4 Dec 2017 01: 43: 41 UTC (79 KB)", "Total citations": "Cited by 1\n2018", "Scholar articles": "Vulnerabilities in the use of similarity tables in combination with pseudonymisation to preserve data privacy in the UK Office for National Statistics' Privacy-Preserving Record Linkage\nC Culnane, BIP Rubinstein, V Teague - arXiv preprint arXiv:1712.00871, 2017\nCited by 1 Related articles All 4 versions"}, {"title": "Exploiting Worker Correlation for Label Aggregation in Crowdsourcing", "Authors": "Yuan Li, Benjamin Rubinstein, Trevor Cohn", "Publication date": "2019/5/24", "Conference": "International Conference on Machine Learning", "Pages": "3886-3895", "Description": "Crowdsourcing has emerged as a core component of data science pipelines. From collected noisy worker labels, aggregation models that incorporate worker reliability parameters aim to infer a latent true annotation. In this paper, we argue that existing crowdsourcing approaches do not sufficiently model worker correlations observed in practical settings; we propose in response an enhanced Bayesian classifier combination (EBCC) model, with inference based on a mean-field variational approach. An introduced mixture of intra-class reliabilities—connected to tensor decomposition and item clustering—induces inter-worker correlation. EBCC does not suffer the limitations of existing correlation models: intractable marginalisation of missing labels and poor scaling to large worker cohorts. Extensive empirical comparison on 17 real-world datasets sees EBCC achieving the highest mean accuracy across 10 benchmark crowdsourcing methods.", "Scholar articles": "Exploiting Worker Correlation for Label Aggregation in Crowdsourcing\nY Li, B Rubinstein, T Cohn - International Conference on Machine Learning, 2019\nRelated articles"}, {"title": "Adversarial Reinforcement Learning under Partial Observability in Software-Defined Networking", "Authors": "Yi Han, David Hubczenko, Paul Montague, Olivier De Vel, Tamas Abraham, Benjamin IP Rubinstein, Christopher Leckie, Tansu Alpcan, Sarah Erfani", "Publication date": "2019/2/25", "Journal": "arXiv preprint arXiv:1902.09062", "Description": "Recent studies have demonstrated that reinforcement learning (RL) agents are susceptible to adversarial manipulation, similar to vulnerabilities previously demonstrated in the supervised setting. Accordingly focus has remained with computer vision, and full observability. This paper focuses on reinforcement learning in the context of autonomous defence in Software-Defined Networking (SDN). We demonstrate that causative attacks---attacks that target the training process---can poison RL agents even if the attacker only has partial observability of the environment. In addition, we propose an inversion defence method that aims to apply the opposite perturbation to that which an attacker might use to generate their adversarial samples. Our experimental results illustrate that the countermeasure can effectively reduce the impact of the causative attack, while not significantly affecting the training process in non-attack scenarios.", "Scholar articles": "Adversarial Reinforcement Learning under Partial Observability in Software-Defined Networking\nY Han, D Hubczenko, P Montague, O De Vel… - arXiv preprint arXiv:1902.09062, 2019\nRelated articles All 3 versions"}, {"title": "A Note on Bounding Regret of the CUCB Contextual Combinatorial Bandit", "Authors": "Bastian Oetomo, Malinga Perera, Renata Borovica-Gajic, Benjamin IP Rubinstein", "Publication date": "2019/2/20", "Journal": "arXiv preprint arXiv:1902.07500", "Description": "We revisit the proof by Qin et al.(2014) of bounded regret of the C UCB contextual combinatorial bandit. We demonstrate an error in the proof of volumetric expansion of the moment matrix, used in upper bounding a function of context vector norms. We prove a relaxed inequality that yields the originally-stated regret bound.", "Scholar articles": "A Note on Bounding Regret of the C $^ 2$ UCB Contextual Combinatorial Bandit\nB Oetomo, M Perera, R Borovica-Gajic, BIP Rubinstein - arXiv preprint arXiv:1902.07500, 2019\nRelated articles All 4 versions"}, {"title": "Truth Inference at Scale: A Bayesian Model for Adjudicating Highly Redundant Crowd Annotations", "Authors": "Yuan Li, Benjamin IP Rubinstein, Trevor Cohn", "Publication date": "2019", "Conference": "Proceedings of the 2019 World Wide Web Conference on World Wide Web", "Description": "Crowd-sourcing is a cheap and popular means of creating training and evaluation datasets for machine learning, however it poses the problem of'truth inference', as individual workers cannot be wholly trusted to provide reliable annotations. Research into models of annotation aggregation attempts to infer a latent'true'annotation, which has been shown to improve the utility of crowd-sourced data. However, existing techniques beat simple baselines only in low redundancy settings, where the number of annotations per instance is low (= 3), or in situations where workers are unreliable and produce low quality annotations (eg, through spamming, random, or adversarial behaviours.) As we show, datasets produced by crowd-sourcing are often not of this type: the data is highly redundantly annotated (= 5 annotations per instance), and the vast majority of workers produce high quality outputs. In these settings, the …", "Scholar articles": "Truth Inference at Scale: A Bayesian Model for Adjudicating Highly Redundant Crowd Annotations\nY Li, B IP Rubinstein, T Cohn - The World Wide Web Conference, 2019\nRelated articles All 3 versions"}, {"title": "Differentially-Private Two-Party Egocentric Betweenness Centrality", "Authors": "Leyla Roohi, Benjamin IP Rubinstein, Vanessa Teague", "Publication date": "2019", "Conference": "2019 IEEE Conference on Computer Communications, INFOCOM 2019", "Description": "We describe a novel protocol for computing the egocentric betweenness centrality of a node when relevant edge information is spread between two mutually distrusting parties such as two telecommunications providers. While each node belongs to one network or the other, its ego network might include edges unknown to its network provider. We develop a protocol of differentially-private mechanisms to hide each network’s internal edge structure from the other; and contribute a new two-stage stratified sampler for exponential improvement to time and space efficiency. Empirical results on several open graph data sets demonstrate practical relative error rates while delivering strong privacy guarantees, such as 16% error on a Facebook data set.", "Scholar articles": "Differentially-private two-party egocentric betweenness centrality\nL Roohi, BIP Rubinstein, V Teague - IEEE INFOCOM 2019-IEEE Conference on Computer …, 2019\nRelated articles All 3 versions"}, {"title": "Attacking Data Transforming Learners at Training Time", "Authors": "Scott Alfeld, Ara Vartanian, Lucas Newman-Johnson, Benjamin IP Rubinstein", "Publication date": "2019", "Conference": "Thirty-Third AAAI Conference on Artificial Intelligence", "Description": "While machine learning systems are known to be vulnerable to data-manipulation attacks at both training and deployment time, little is known about how to adapt attacks when the defender transforms data prior to model estimation. We consider the setting where the defender Bob first transforms the data then learns a model from the result; Alice, the attacker, perturbs Bob’s input data prior to him transforming it. We develop a generalpurpose “plug and play” framework for gradient-based attacks based on matrix differentials, focusing on ordinary least-squares linear regression. This allows learning algorithms and data transformations to be paired and composed arbitrarily: attacks can be adapted through the use of the chain rule—analogous to backpropagation on neural network parameters—to compositional learning maps. Best-response attacks can be computed through matrix multiplications from a library of attack matrices for transformations and learners. Our treatment of linear regression extends state-of-the-art attacks at training time, by permitting the attacker to affect both features and targets optimally and simultaneously. We explore several transformations broadly used across machine learning with a driving motivation for our work being autogressive modeling. There, Bob transforms a univariate time series into a matrix of observations and vector of target values which can then be fed into standard learners. Under this learning reduction, a perturbation from Alice to a single value of the time series affects features of several data points along with target values.", "Scholar articles": "Attacking Data Transforming Learners at Training Time\nS Alfeld, A Vartanian, L Newman-Johnson… - 2019\nRelated articles All 2 versions"}, {"title": "Fast Manifold Landmarking Using Locality-Sensitive Hashing", "Authors": "Zay Maung Maung Aye, Benjamin IP Rubinstein, Kotagiri Ramamohanarao", "Publication date": "2018/6/3", "Conference": "Pacific-Asia Conference on Knowledge Discovery and Data Mining", "Pages": "452-464", "Publisher": "Springer, Cham", "Description": "Manifold landmarks can approximately represent the low-dimensional nonlinear manifold structure embedded in high-dimensional ambient feature space. Due to the quadratic complexity of many learning algorithms in the number of training samples, selecting a sample subset as manifold landmarks has become an important issue for scalable learning. Unfortunately, state-of-the-art Gaussian process methods for selecting manifold landmarks themselves are not scalable to large datasets. In an attempt to speed up learning manifold landmarks, uniformly selected minibatch stochastic gradient descent is used by the state-of-the-art approach. Unfortunately, this approach only goes part way to making manifold learning tractable. We propose two adaptive sample selection approaches for gradient-descent optimization, which can lead to better performance in accuracy and computational time. Our methods …", "Scholar articles": "Fast Manifold Landmarking Using Locality-Sensitive Hashing\nZMM Aye, BIP Rubinstein, K Ramamohanarao - Pacific-Asia Conference on Knowledge Discovery and …, 2018\nRelated articles"}, {"title": "Options for encoding names for data linking at the Australian Bureau of Statistics", "Authors": "Chris Culnane, Benjamin IP Rubinstein, Vanessa Teague", "Publication date": "2018/2/22", "Journal": "arXiv preprint arXiv:1802.07975", "Description": "Publicly, ABS has said it would use a cryptographic hash function to convert names collected in the 2016 Census of Population and Housing into an unrecognisable value in a way that is not reversible. In 2016, the ABS engaged the University of Melbourne to provide expert advice on cryptographic hash functions to meet this objective.\nFor complex unit-record level data, including Census data, auxiliary data can be often be used to link individual records, even without names. This is the basis of ABS's existing bronze linking. This means that records can probably be re-identified without the encoded name anyway. Protection against re-identification depends on good processes within ABS.", "Scholar articles": "Options for encoding names for data linking at the Australian Bureau of Statistics\nC Culnane, BIP Rubinstein, V Teague - arXiv preprint arXiv:1802.07975, 2018\nRelated articles All 3 versions"}, {"title": "Differentially private counting of users’ spatial regions", "Authors": "Maryam Fanaeepour, Benjamin IP Rubinstein", "Publication date": "2018/1/1", "Journal": "Knowledge and Information Systems", "Volume": "54", "Issue": "1", "Pages": "5-32", "Publisher": "Springer London", "Description": "Mining of spatial data is an enabling technology for mobile services, Internet-connected cars and the Internet of Things. But the very distinctiveness of spatial data that drives utility can cost user privacy. Past work has focused upon points and trajectories for differentially private release. In this work, we continue the tradition of privacy-preserving spatial analytics, focusing not on point or path data, but on planar spatial regions. Such data represent the area of a user’s most frequent visitation—such as “around home and nearby shops”. Specifically we consider the differentially private release of data structures that support range queries for counting users’ spatial regions. Counting planar regions leads to unique challenges not faced in existing work. A user’s spatial region that straddles multiple data structure cells can lead to duplicate counting at query time. We provably avoid this pitfall by leveraging the Euler …", "Scholar articles": "Differentially private counting of users’ spatial regions\nM Fanaeepour, BIP Rubinstein - Knowledge and Information Systems, 2018\nRelated articles All 7 versions"}, {"title": "Exploring misconceptions as a trigger for enhancing student learning", "Authors": "H. Verkade, J.M. Lodge, K. Elliott, T.D. Mulhern, A.A. Espinosa, S.J. Cropper, B.I.P. Rubinstein", "Publication date": "2017/6", "Conference": "Higher Education Research and Development Society of Australasia", "Description": "This article addresses the importance of confronting misconceptions in the teaching of the STEM disciplines. First, we review the central place for threshold concepts in many disciplines and the threat misconceptions pose to quality education. Second, approaches will be offered for confronting misconceptions in the classroom in different contexts. Finally, we discuss what we can learn about these approaches and the common threads that reveal successful approaches. These steps have been explored in relation to four case studies across diverse disciplines. From these case studies, a set of principles about how best to address misconceptions in STEM disciplines has been distilled. As conceptual knowledge increases in importance in higher education, effective strategies for helping students develop accurate conceptual understanding will also be increasingly critical.", "Scholar articles": "Exploring misconceptions as a trigger for enhancing student learning\nH Verkade, JM Lodge, K Elliott, TD Mulhern… - 2017\nRelated articles All 4 versions"}, {"title": "Response to the Productivity Commission's draft report on data availability and use", "Authors": "Chris Culnane, Benjamin Rubinstein, Vanessa Teague", "Publication date": "2016/12/15", "Description": "• De-identification doesn't work—it does not solve the problem of making sensitive unit-recordlevel data available openly but safely. The ease of re-identification is context and timedependent–relying on de-identification for privacy is unwarranted because re-identification only gets easier as more auxiliary information is made more widely available for linking. Data privacy and utility are at odds in this context. If not enough information is removed, people's records may be easily re-identified; if too much is removed, scientists may find it useless for research. For some datasets, there may be no point that is acceptable by both criteria.", "Scholar articles": "Response to the Productivity Commission's draft report on data availability and use\nC Culnane, B Rubinstein, V Teague\nRelated articles"}, {"title": "Entity based search and resolution", "Inventors": "Ashok K Chandra, Olivier Jerzy Dabrowski, David James Gemmell, Benjamin Rubinstein", "Publication date": "2016/9/13", "Patent office": "US", "Patent number": "9443021", "Application number": "13341284", "Description": "Systems, methods, and computer-readable storage media for providing a rich search experience utilizing entity-type characterization are provided. A search query is received and an entity type is determined for the query. A Web search is then performed for the query against a predefined list of sources determined to be authoritative for the determined entity type. The results of the source-specific searches are filtered based upon the entity type providing a filtered list of results that each pertains to an entity of the entity type determined to be associated with the query. The filtered list are then compared to a list of resolved entities to determine equivalent entities identified by different searched sources, the equivalent entities being combined into a single potential search result. The consolidated search results are then ordered based upon rank values. At least a portion of the results may then be presented to the user.", "Scholar articles": "Entity based search and resolution\nAK Chandra, OJ Dabrowski, DJ Gemmell, B Rubinstein - US Patent 9,443,021, 2016\nRelated articles All 4 versions"}, {"title": "TopicResponse: A Marriage of Topic Modelling and Rasch Modelling for Automatic Measurement in MOOCs", "Authors": "Jiazhen He, Benjamin IP Rubinstein, James Bailey, Rui Zhang, Sandra Milligan", "Publication date": "2016/7/29", "Journal": "arXiv preprint arXiv:1607.08720", "Description": "This paper explores the suitability of using automatically discovered topics from MOOC discussion forums for modelling students' academic abilities. The Rasch model from psychometrics is a popular generative probabilistic model that relates latent student skill, latent item difficulty, and observed student-item responses within a principled, unified framework. According to scholarly educational theory, discovered topics can be regarded as appropriate measurement items if (1) students' participation across the discovered topics is well fit by the Rasch model, and if (2) the topics are interpretable to subject-matter experts as being educationally meaningful. Such Rasch-scaled topics, with associated difficulty levels, could be of potential benefit to curriculum refinement, student assessment and personalised feedback. The technical challenge that remains, is to discover meaningful topics that simultaneously achieve good statistical fit with the Rasch model. To address this challenge, we combine the Rasch model with non-negative matrix factorisation based topic modelling, jointly fitting both models. We demonstrate the suitability of our approach with quantitative experiments on data from three Coursera MOOCs, and with qualitative survey results on topic interpretability on a Discrete Optimisation MOOC.", "Scholar articles": "TopicResponse: A Marriage of Topic Modelling and Rasch Modelling for Automatic Measurement in MOOCs\nJ He, BIP Rubinstein, J Bailey, R Zhang, S Milligan - arXiv preprint arXiv:1607.08720, 2016\nRelated articles All 4 versions"}, {"title": "Large Scale Metric learning", "Authors": "Zay Maung Maung Aye, Kotagiri Ramamohanarao, Benjamin IP Rubinstein", "Publication date": "2016/7/24", "Conference": "2016 International Joint Conference on Neural Networks (IJCNN)", "Pages": "1442-1449", "Publisher": "IEEE", "Description": "Many machine learning and pattern recognition algorithms rely heavily on good distance metrics to achieve competitive performance. While distance metrics can be learned, the computational expense of doing so is currently infeasible on large datasets. In this paper, we propose two efficient-and-effective approaches for selecting the training dataset using Locality-Sensitive Hashing (LSH) with discriminative information, and with K-Means clustering inside LSH buckets, for accelerating metric learning. Our methods yield a speedup factor of (N/C) 2 , where N is training set size and C ≪ N is the user-selected compressed set size, achieving quadratic speedup to metric learning often realized as a 1-2 or more orders of magnitude improvement with little degradation to accuracy. For example, our generic filter approach enables the current overall fastest Large Margin Nearest Neighbor (LMNN) to learn metrics on one …", "Scholar articles": "Large Scale Metric learning\nZMM Aye, K Ramamohanarao, BIP Rubinstein - 2016 International Joint Conference on Neural …, 2016\nRelated articles"}, {"title": "Sub-Merge: Diving Down to the Attribute-Value Level in Statistical Schema Matching.", "Authors": "Zhe Lim, Benjamin IP Rubinstein", "Publication date": "2015/1/25", "Conference": "Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI'2015)", "Pages": "1791-1797", "Description": "Matching and merging data from conflicting sources is the bread and butter of data integration, which drives search verticals, e-commerce comparison sites and cyber intelligence. Schema matching lifts data integration-traditionally focused on well-structured data-to highly heterogeneous sources. While schema matching has enjoyed significant success in matching data attributes, inconsistencies can exist at a deeper level, making full integration difficult or impossible. We propose a more fine-grained approach that focuses on correspondences between the values of attributes across data sources. Since the semantics of attribute values derive from their use and co-occurrence, we argue for the suitability of canonical correlation analysis (CCA) and its variants. We demonstrate the superior statistical and computational performance of multiple sparse CCA compared to a suite of baseline algorithms, on two datasets which we are releasing to stimulate further research. Our crowd-annotated data covers both cases that are relatively easy for humans to supply ground-truth, and that are inherently difficult for human computation.", "Scholar articles": "Sub-merge: diving down to the attribute-value level in statistical schema matching\nZ Lim, B Rubinstein - Twenty-Ninth AAAI Conference on Artificial Intelligence, 2015\nRelated articles All 4 versions\nAttribute-Value-Level Matching*\nZ Lim, B RUBINSTEIN - 2014"}, {"title": "Workshop Summary of AISec'14: 2014 Workshop on Artificial Intelligent and Security", "Authors": "Christos Dimitrakakis, Aikateini Mitrokotsa, Benjamin IP Rubinstein", "Publication date": "2014/11/3", "Conference": "Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security", "Pages": "1555-1555", "Publisher": "ACM", "Description": "It is our great pleasure to welcome you to the 2014 ACM Workshop Artificial Intelligence and Security (AISec 2014)--the seventh annual workshop addressing technologies that fuse intelligent systems into computer security applications and the implications of these approaches. The workshop's aim is to advance research at the intersection of artificial intelligence, machine learning, privacy and security. In particular, AISec gives researchers and practitioners working within one or more of those fields a platform for interdisciplinary discussion, which would otherwise be lacking. Hopefully, the workshop will lead to the initiation of knew col-laborations between groups working across these areas. The papers to be presented in this year's program include topics such as the analysis of privacy, adversarial learning models, intrusion detection and automatic advertisement filtering. We are delighted to again be co-located …", "Scholar articles": "Workshop Summary of AISec'14: 2014 Workshop on Artificial Intelligent and Security\nC Dimitrakakis, A Mitrokotsa, BIP Rubinstein - Proceedings of the 2014 ACM SIGSAC Conference on …, 2014"}, {"title": "Fifth ACM Workshop on Artificial Intelligence and Security (AISec 2012)", "Authors": "Alvaro A Cárdenas, Blaine Nelson, Benjamin IP Rubinstein", "Publication date": "2012/10/16", "Conference": "Proceedings of the 2012 ACM Conference on Computer and Communications Security", "Pages": "1056-1057", "Publisher": "ACM", "Description": "The Workshop on Artificial Intelligence and Security (AISec) focuses on using Artificial Intelligence (AI) and Machine Learning methods to address the unique problems posed within the Security and Privacy application areas and on the implications of using those methods to solve such adversarial problems. The workshop serves as the premier venue for this particular fusion of application, algorithms, and theory and continues to attract submissions from a diverse set of researchers, who address newly arising problems within this ever growing field. The main goal of the workshop is to provide a forum for researchers within the Security, Privacy, Artificial Intelligence (AI), and Machine Learning communities to discuss the role of AI and learning in security and privacy applications and, conversely, to present the unique needs of these problems to the AI and learning communities.", "Scholar articles": "Fifth ACM workshop on artificial intelligence and security (AISec 2012)\nAA Cárdenas, B Nelson, BIP Rubinstein - Proceedings of the 2012 ACM conference on …, 2012"}, {"title": "Corrigendum to “Shifting: One-inclusion mistake bounds and sample compression”[J. Comput. System Sci. 75 (1)(2009) 37–59]", "Authors": "Benjamin IP Rubinstein, Peter L Bartlett, J Hyam Rubinstein", "Publication date": "2010/5/1", "Journal": "Journal of Computer and System Sciences", "Volume": "76", "Issue": "3-4", "Pages": "278-280", "Publisher": "Academic Press", "Description": "H. Simon and B. Szörényi have found an error in the proof of Theorem 52 of “Shifting: One-inclusion mistake bounds and sample compression”, Rubinstein et al. (2009) [3]. In this note we provide a corrected proof of a slightly weakened version of this theorem. Our new bound on the density of one-inclusion hypergraphs is again in terms of the capacity of the multilabel concept class. Simon and Szörényi have recently proved an alternate result in Simon and Szörényi (2009) [4].", "Scholar articles": "Corrigendum to “Shifting: One-inclusion mistake bounds and sample compression”[J. Comput. System Sci. 75 (1)(2009) 37–59]\nBIP Rubinstein, PL Bartlett, JH Rubinstein - Journal of Computer and System Sciences, 2010\nRelated articles All 5 versions\nERRATUM TO SHIFTING: ONE-INCLUSION MISTAKE BOUNDS AND SAMPLE COMPRESSION*\nBIP Rubinstein, PL Bartlett, JH Rubinstein\nRelated articles"}, {"title": "Corrigendum to Shifting: One-inclusion mistake bounds and sample compression", "Authors": "B RUBINSTEIN, P BARTLETT, J RUBINSTEIN", "Publication date": "2010", "Scholar articles": "Corrigendum to Shifting: One-inclusion mistake bounds and sample compression\nB RUBINSTEIN, P BARTLETT, J RUBINSTEIN - 2010"}, {"title": "1st Deep Learning and Security Workshop", "Authors": "Nikolaos Vasiloglou, Roberto Perdisci, Babak Rahbarinia, Andrew Gardner, Dawn Song, Ian Goodfellow, Wenke Lee, Alexandros Dimakis, Alvaro Cardenas, Alina Oprea, Baris Coskun, Battista Biggio, Benjamin Rubinstein, Bo Li, Christos Dimitrakakis, Giorgio Giacinto, Javier Echauz, Kang Li, Kevin Roundy, Konrad Rieck, Lorenzo Cavallaro, Neil Zhenqiang Gong, Nicolas Papernot, Philip Tully, Polo Chau, Sai Deep Tetali, Tummalapalli S Reddy, Yinzhi Cao, Yizheng Chen, Yufei Han", "Description": "Over the past decade, machine learning methods have found their way into a large variety of computer security applications, including accurate spam detection, scalable discovery of new malware families, identifying malware download events in vast amounts of web traffic, detecting software exploits, blocking phishing web pages, and preventing fraudulent financial transactions, just to name a few.\nMachine learning methods themselves have evolved. In particular, Deep Learning methods have recently demonstrated great improvements over more “traditional” learning approaches on a number of important tasks, including image and audio classification, natural language processing, machine translation, etc. It is therefore natural to ask how the success of these deep learning methods may be translated to advancing the state-of-the-art in security applications. At the same time, while the increasing adoption of Deep …", "Scholar articles": "1st Deep Learning and Security Workshop\nN Vasiloglou, R Perdisci, B Rahbarinia, A Gardner…\nAll 4 versions"}]}